
------------------------------

- Basic Commands:
  ==============
# reload 
# show flash 
# show start 
# show run 
# copy run start    or      # write   >> (to save the configuration that you write at the RAM to the NVRAM)
# show version                        >> (to see witch booting you use from the configuration register 0x2102 or 0x2142 "by pass NVRAM")

- you can erase the startup-config file using three different commands:
----------------------------------------------------------------------
   # write erase 
   # erase startup-config 
   # erase nvram
------------------
(config)# banner motd $ ---------- $
(config)# hostname mm
(config)# cdp run 		###CDP ( Cisco Discovery Protocol) learn about direct neighbors only		
(config)# no ip domain-lookup (or ctrl shift 6)

# show banner motd

========================================================================================
user PC CMD:
============
> tracert teams.microsoft.com
> ping 8.8.8.8 -t
> ping 8.8.8.8 -l 1300 -t
> ipconfig /all                    >>>>> Get MAC add & IP add
pc1> ip 10.0.99.100/32 10.0.99.1   >>>>> set IP and gateway 
pc1> ip dhcp 

========================================================================================

- MAC shows:
  =========
# show mac address-table
# show mac address-table {dynamic | static | secure} {address "mac-add" | interface "int-id" | vlan "vlan-id"}    >>>>> mac representation (20-16-42-3c-9b-f6 or 2016.423c.9bf6)
                                           
#show mac adrress-table static 0000.1111.2222 vlan 1 int f0/1

# show mac adrress-table aging-time                                                                               >>>>> max age = 300 sec
# show mac adrress-table count                                                                                    >>>>> mac adds table empty space and consumed space by each vlan 

# clear mac address-table dynamic [{address "mac-add" | interface "int-id" | vlan "vlan-id"}]
# clear mac adrress-table
# clear mac adrress-table dynamic

s(config)# mac address-table static "mac-address" vlan "vlan-id" {drop | interface "interface-id"}               >>>>> adds a manual entry with the ability to associate it to a specific 
                                                                                                                       switch port or to drop traffic upon receipt                                                                                                 


============================================================================================

Router:
======

R(config)# int f0/1
R(config-if)# ip address 10.0.0.1 255.0.0.0
R(config-if)# no shutdown

R# show ip interface {brief | "interface-id" | vlan "vlan-id"}                          >>>>> MTU, DHCP relay agent, ACLs, interface/primary IP address, method"manual/DHCP", status 
R# show ip interface brief | exclude unassigned                                         >>>>> ints that configured with ip add
R# show ip interface brief | includ 0/0
 # show protocols                                                                       >>>>> = sh ip int br

R# show ip route                                                                        >>>>> routing table content 
R# show ip route 10.132.139.102
R# show ip route connected
R# show ip route | inc vlan700

# trace route 10.244.192.1

# show interfaces 
# show interfaces vlan 1                                                      >>>>> status, internet IP-add
# show interfaces gi0/0/1                                                     >>>>> used for serial cables or any other cable
# show interfaces gi0/0/1 | include drops|CRC|rate|input errors               >>>>> output drops, FSC errors duto collision, input/output utilization 
# show interfaces gi0/0/1 | include rate|MTU|dup                              >>>>> input/output utilization, MTU & operational speed, operational speed and duplex
# show interfaces gi0/0/1 | include CRC|late collision|collision|frame        >>>>> errors indicats duplex missmatch 

# show interfaces status                                                                   
# show interfaces gi0/0/1 status                                              >>>>> descreption, speed&duplex, port status, port mode and assigned vlan if access
                                                                              >>>>> validat routed interface
                                                                              >>>>> check errdisabled interfaces

# show interfaces description 
# show interfaces description | in WLAN
# show interfaces description | in 1/0/1|4/0/2
# show interfaces gi0/0/1 counters

# show interfaces switchport 
# show interfaces gi0/0/1 switchport                                         >>>>> port state "up,down" , operational mode "access, trunk" , if down due to carrier , 
                                                                                   vlan assigned to the access port 
                                                                             >>>>> MLS Switchport: status "Enabled, Disabled" 
                                                                             >>>>> show negotiation status
                                   
# show interfaces port-channel 1                                             >>>>> check L3 etherchannel IP address
# show interfaces trunk
# show run interface gi1/0/1                                                 >>>>> port-security config, vlan config, FHRP, ip-add, 

# show etherchannel summary                                                  >>>>> P(in port-channel) active and working, D(down), I(stand-alone) peer not active, s(suspended) interface config not match
# show etherchannel # summary
# show etherchannel # port-channel

# show run | section er ospf

# show log | i 1/0/5
# show logg | i gig2/0/1, changed state to
# show logg | i A Broadcast storm detected
# show logg | i Host                           >>>>> check if looping host exist 
# show logg | i bpduguard error detected

# trace route 10.244.192.1
# trace 10.158.6.160 so vlan100
# ping 10.167.81.81 source 10.167.81.82
# ping 8.8.8.8 so vlan300
# ping 8.8.8.8 re 50 siz 100
# ping 10.158.6.160 so lo0/vl950

R# show ipv6 interface {brief | interface-id | vlan vlan-id}
R# show ipv6 interface brief | exclude unassigned | gigabitEthernet

============================================================================================

1-line console password:
  =====================
Method1))
(config)# line console 0 
(config-line)# password 123
(config-line)# login

Method2))MD5 encryption
(config)# username mohab secret 123
(config)# username mohab1 privilege 15 secret 789  (default privilege=1)
(config)# line console 0
(config-line)# login local  (layer of security, privilege, accounting)

or)))))))
(config)# username mohab algorithm-type sha256 secret 123    >>>>> SHA-256 type-8 encryption/Hashes 
(config)# username mohab algorithm-type scrypt secret 123    >>>>> SHA-256 type-9 encryption/Hashes 
-------------------------
# show run

============================================================================================

>> Switched virtual interface (SVI) (VLAN Interface)
   ================================
(config)# interface vlan 1                                                       >>>>> make sure vlan active and one port belong to the vlan and in up state 
(config-if)# ip address 192.168.1.200  255.255.255.0 (or ip address dhcp)
(config-if)# no shutdown

(config)# ip default-gateway 192.168.1.1
(config)# ip name-server (ip1) (ip2)      >> DNS

>> Router interface
   ================
(config)# interface f0/1
(config-if)# ip address 192.168.1.200  255.255.255.0 (or ip address dhcp)
(config-if)# no shutdown


>> IP address Assignment:
   =====================
   - It's possible to attach multiple ip to the same interface
     . IPv4:
       (config-if)# ip address "ip-add" "mask" secondary
     . IPv6:
       (config-if)# ipv6 address "ipv6-add/prefix-length"    >>>>> can be repeated multiple times to add multiple ipv6 address to the same interface

============================================================================================

2- line vty password:
   =================
telnet:
------
Method1))
(config)# line vty 0 4                                                          >>>>> vty"virtul session", 0-4 "number of sessions" 
(config-line)# password 123
(config-line)# login

Method2))
(config)# username mohab1 privilege 15 secret 789  (default privilege=1)
(config)# username mohab secret 123
(config)# line vty 0 4
(config-line)# login local

or)))))))
(config)# username mohab algorithm-type sha256 secret 123    >>>>> SHA-256 type-8 encryption/Hashes 
(config)# username mohab algorithm-type scrypt secret 123    >>>>> SHA-256 type-9 encryption/Hashes 


# telnet 10.0.0.1
# (ctrl shift 6) x    
# resume 1  (or enter twice)
-------------------------
# show run


---------------------------------------------------------------
   > ACL with line vty:
     -----------------
      (config)# line vty 0 4                                                          
      (config-line)# password 123
      (config-line)# access-class 3 in

      (config)# access-list 3 permit 10.1.1.0 0.0.0.255
---------------------------------------------------------------

============================================================================================

SSH:                                                                        >>>>> must use username and password
----
(config)# username mohab1 privilege 15 secret 789  (default privilege=1)
(config)# username mohab secret 123
or)))))))
(config)# username mohab algorithm-type sha256 secret 123                >>>>> SHA-256 type-8 encryption/Hashes 
(config)# username mohab algorithm-type scrypt secret 123                >>>>> SHA-256 type-9 encryption/Hashes 

(config)# line vty 0 4
(config-line)# login local

(config)#hostname sw
(config)# ip domain name cisco.com                                           >>>>>  (The SSH server uses the fully qualified domain name (FQDN) "includ host & domain name" of the switch as input to create that key)
(config)# crypto key generate rsa                                            >>>>>  (default key size 512 but minimmum requirement for v2 768)
(config)# ip ssh version 2                                                   >>>>>  activate ssh v2 
-------------
 # ssh –L mohab 10.0.0.1                                                     >>>>> access by using ssh user mohab remote device 10.0.0.1
-------------

(config)# line vty 0 4
(config-line)# transport input  {ssh, telnet, all, none}                     >>>>> allow the protocol that's going to be permitted on the device 
                                                                                      - the default on the router telnet & SSH denied 
                                                                                      - the default on the switch telnet & SSH permitted 
-------------
(config)# ip ssh ?
# show ssh                                                                     >>>>> show who is connected via a session by ssh
# show ip ssh                                                                  >>>>> show ssh server details 
# clear line #
# show run

---------------------------------------------------------------
   > ACL with line vty:
     -----------------
      (config)# line vty 0 4                                                          
      (config-line)# password 123
      (config-line)# access-class 3 in

      (config)# access-list 3 permit 10.1.1.0 0.0.0.255
---------------------------------------------------------------

============================================================================================

3- enable mode:
   ===========
Mathod-1))
--------
(config)# enable secret 123                                >>>>> (activate massage digest 5(MD5) encryption) "internal runing configuration file incrypts the enable secret password"
(config)# enable [algorithm-type md5] secret 123
------------
Method-2))
--------
(config)# enable password 123                              >>>>> (password is a clear text in the runing configuration file)
(config)# service password-encryption                      >>>>> (activate massage digest 7(MD7) encryption to encrypt the clear text password) "less powerful than MD5" 
                                                                  "incrypts all the current passwords and any future passwords"
(config)#no service password-encryption                    >>>>> cancel the encreption on the future password "the allredy encrypted passwords will remain incrypted"
------------
Method-3)) SHA "secure hashing algorithm"
--------
(config)# enable algorithm-type sha256 secret 123          >>>>> enable SHA-256 type-8 encryption/Hashes 
or))))))
(config)# enable algorithm-type scrypt secret 123          >>>>> enable SHA-256 type-9 encryption/Hashes 


-------------------------
# show run | include enable


==========================================================================================
(config-line)# exec-timeout min sec                        >>>>> session timer before the seesion drops for (console, telnet, ssh) if no admin actions occuars 
                                                                  - If min=0, sec=0 "session will not expire at all"
(config-line)# logging synchronous                         >>>>> cancel system messege intrruptions 

(config-line)# history size #                              >>>>> (set a size for just this session type) "commands to be saved for reuse"
# terminal history size #                                  >>>>> (set a size for all session types) "commands to be saved for reuse"

# show history                                                >>>>> showing the saved commands 


==========================================================================================
AAA (Authentication, Authorization, and Accounting)
===
Authentication >>>>> confirm if username&password are allowed?
Authorization  >>>>> confirm the user privlges
Accounting     >>>>> monitoring the sessions and save logs

>> AAA server use Radius or Tacacs+ protocols to encrypt the data 
==========================================================================================

Configuring Speed, Duplex, and Description:
==========================================   

(config-if)# duplex {auto | full | half} 
(config-if)# speed {auto | 10 | 100 | 1000}
(config-if)# description   xxxx


(config)# int f0/1      
(config)# int range f0/2 -20                                                      >>>>> configuer range of interfaces at once 
(config-if)# duplex full
(config-if)# speed 100
(config-if)# description   xxxx

# show interfaces status                                                         >>>>> descreption, speed&duplex, port status, port mode and assigned vlan if access
# show interfaces f0/1 status

# show interfaces gi0/0/1                                                        >>>>> counters (input packets, CRC "cycle redaundancy check", frame "colision", output errors, collision, late collision)                                                                                                 
# show interfaces gi0/0/1 | include drops|CRC|rate                               >>>>> output drops, FSC errors duto collision, input/output utilization 
# show interfaces gi0/0/1 | include rate|MTU|dup                                 >>>>> input/output utilization, MTU & operational speed, operational speed and duplex
# show interfaces gi0/0/1 | include CRC|late collision|collision|frame|dup       >>>>> errors indicats duplex missmatch, operational speed and duplex 
# show interfaces gi0/0/1 counters                                               >>>>> in and out frames (BC, multicast, unicast) 

# show interfaces description 

-Note that the text includes the a- to mean that 
the listed speed and duplex values were autonegotiated.


==========================================================================================
>> Virtual LAN (VLAN):
   ==================
   - Defult all switch ports in VLAN1 

    port modes:
    ----------
     - Access mode >End devices           (one vlan & untagged)
     - Trunk mode  > intermediate devices (many vlans & tagged)
       . 802.1Q protocol used for VLAN Tagging "VLAN ID" (4byte Header)

    VLANs range 12 bit:
    ------------------
      0 & 4095 & 1002-1005 reserved vlans 
      normal range >> 1 - 1005
      extended range >> 1006 - 4094

802.1Q support Native VLAN for trunk ports (VLAN with no tag)
 - forward traffic 
 - if old switch not supporting trunk 
 - used for telnet&SSH "management traffic"
 - used for DTP traffic 

VLAN Hopping error = Native VLAN missmatch                         >>>>> normally block the conection between the two intermediate devices 
                                                                         (interface to come up again correct the VLAN and shut/unshut)

-------------------------------------------------------------------
s(config)# vlan 2 (or vlan 10,20) (or vlan 4-9)
s(config-vlan)# name HR  "32 characters"

s(config)# int range f0/1 -5 , f0/10 -13
s(config-if-range)# switchport mode access
s(config-if-range)# switchport access {vlan 10 | name VLAN0010}     >>>>> if you does not create the vlan it will be created auto by this command 
---------------------------------------------

----------------------
# show vlan [ {brief | id "vlan-id" | name "vlan-name" | summary} ]  

# show vlan brief            >>>>> VLAN #, VLAN name, VLAN status, VLAN ports
# show vlan                  >>>>> vlan to port assignments, system MTU, SPAN sessions, private VLANs
# show vlan id 2
# show vlan name VLAN0002
# show vlan summary          >>>>> existing vlans, VTP VLANs, extended VLANs
# show running-config
----------------------

----------------------
s(config)# int f0/0
s(config-if)# switchport trunk encapsulation dot1q                                                                      >>>>> if 802.1q & ISL are available of the switch 
s(config-if)# switchport mode trunk

s(config-if)# switchport trunk native vlan 11                                                                           >>>>> (you can decied one native vlan for each port)
s(config-if)# switchport trunk allowed vlan 1-10                                                                        >>>>> (set allowed list for each port)
s(config-if)# switchport trunk allowed vlan 10,20 
s(config-if)# switchport trunk allowed {vlan-ids | all | none | add "vlan-ids" | remove "vlan-ids" | except "vlan-ids"} >>>>> first method overrides the existing list 
----------------------

----------------------
# show interfaces g0/1 trunk          >>>>> show trunk port status, native vlan, allowed list  
# show interfaces trunk               >>>>> show trunk port status 
# show run int gi1/0/1                >>>>> VLANs that are allowed on a trunk link
# show interfaces gi0/1 switchport    >>>>> port state "up,down" , operational mode "access, trunk" , if down due to carrier , vlan assigned to the access port
# show interfaces switchport
# show dtp
# show interfaces status              >>>>> port-ID, Name "discreption", status, VLAN, Duplex, Speed, Type
# show interfaces f0/1 status
----------------------


==========================================================================================

>> Dynamic Trunking Protocol (DTP)  >>>>> CISCO proprietary protocol
   ================================
 - DTP enabled by default on all cisco switch interfaces 
 - on trunk ports encapsulated by 802.1q control traffic "DTP msgs" flow on Native Vlan
 - on trunk ports encapsulated by isl control traffic "DTP msgs" flow on Vlan 1 
 - Default adminstrative mode for old switches "dynamic desirable"
 - Default adminstrative mode for new switches "dynamic auto"  


1- The administrative mode: "interface status"
s(config-if)# switchport mode access
                              trunk
                              dynamic desirable
                              dynamic auto

2- The type of trunking: "encapsulation type"
s(config-if)# switchport trunk encapsulation negotiate      >>>>> take place for old switches "defult negotiate, old switches prefer isl"
                                             isl 
                                             dot1q 

disable DTP negotiation on interface:
------------------------------------
S(config)# int g0/0
------
1) S(config-if)# switchport nonegotiate
or
2) S(config-if)# switchport mode access

-------------
# show dtp
# show interfaces g0/1 trunk                             >>>>> show trunk port status, native vlan, allowed list 
# show interfaces trunk                                  >>>>> show trunk port status  

# show run interface interface-id                     >>>>> show negotiation status
# show interfaces interface-id switchport | i trunk   >>>>> show negotiation status
==========================================================================================

>> VLAN Trunking Protocol (VTP):
   ===========================
 - rouls for VTP to work:
   ---------------------
  1) All switches must be at the same VTP domain
     . domain by defult = Null (every sw in isolated domain Null, once a domain created at one switch all other switches will join that domain 
                                 after receiving a vtp msg that will be sent from the oregenated sw)

     . domain can have a password "condetion to join"  
     . VTP Advertise:
        > VLAN name, VLAN ID
        > No advertisement for interfaces
        > configuration revision number (CR#)=0
           CR# increase by one after any action >> (add, modify, delete) Vlan  
           (Higher CR# overwrite the devices in the domain with its database)
  2) connection between switches must be trunk interfaces "to allow DTP msgs"
     . VTP msg sent every 5 min
  3) Same VTP version {1, 2, 3}


 - VTP Operating Modes: (Server, Client, Transparent) Default mode = server
   -------------------
    > VTP transparent doesn't learn or synchronizing VLANs only forward them if the version match (1, 2, 3)
    > VTP transparent CR# always=0
    > server mode can configure VLANs in the standard range only (2-1001)

    > VTP messages will not forward through a switch if VTP disabled 
    > VLAN extended range can be configured at 
       1- transparent SW
       2- Disabled VTP SW

    > turn the CR# to zero:
      --------------------
      1- add the switch to deffrent domain
      2- add the switch to transparent mode 
      3- delete vlan.dat from flash or NVRAM (V1,2 or V3)


   ------------------------------------------------------------
        s(config)# vtp mode {server | client | transparent | none}
        s(config)# vtp domain cisco
        optional
        s(config)# vtp password 123
        optional
        s(config)# vtp version {1 | 2 | 3}
    ------------------------------------------------------------
        s(config)# vtp mode off (avoiding using VTP)  


       ---------------
         switch# vtp primary                                 >>>>> must set primary server (V3 VTP only)
                                                                   . only primary server can make changes 
                                                                   . can advertise (Extended Vlan, private vlan, MST configuration) 
       ---------------

     ---------------------
      Show:
        sw# show vtp status                                                  >>>>> TVP version, domain name, mode, number of vlans (S&E), CR#
        sw# show vtp status | i version run | operating | VLANs | Revision
        sw# show vtp password
        sw# show run | section vtp
     ---------------------

          s(config)#no vlan 30     >>>>> homeless vlan "homeless interfaces"  
                                         (to restore the interfaces, activate back the vlan or add the interfaces into another vlan)



==========================================================================================

Forwarding data between VLANS:
==============================
==============================

>> VLAN Routing - (ROAS)
  ======================

1) Activate virtual sub-interface on router 
2) activate trunk on router
>> any configuration on the main interface will impact all the sub interfaces 

------------------------------------------------------------

Sub int:
-------
>> activate the phisycal interface 
>> create the sub-interfaces & Trunk encapsulation on each

R(config)# int g0/0                           >>>>> any action on the phisycal interface will take place on all sub-intrefaces
R(config-if)# no shutdown
------------------------------------------------------------
R(config)# int g0/0.10                        >>>>> .10 doesn't need to match any config but must be unique on the interface (for organaize work match the VLAN) 
R(config-if)# encapsulation dot1q 10          >>>>> number 10 her must match the VLAN that's going to use the sub-interface (indecates what tag will be used) 
R(config-if)# ip address 10.0.0.1 255.0.0.0
-------------------------------------------------------------

Native VLAN:
------------
R(config)# int g0/0.10
R(config-if)# encapsulation dot1q 10 native
R(config-if)# ip address 10.0.0.1 255.0.0.0
-------------------------------             >> OR
R(config)# int g0/0
R(config-if)# ip address 10.0.0.1 255.0.0.0

------------
R# show run interface gi1/0/1 
R# show ip route connected
R# show ip interface brief | includ 0/0
R# show vlans

==========================================================================================

>> VLAN Routing - (MLS)  >>>>> capable for switching "active feature by defualt" and routing "need activation" 
   ====================

1- activate routing
   ----------------
SW(config)# sdm prefer lanbase-routing     >> Hardware activation for old models 
SW# reload

SW(config)# ip routing                     >> Software activation "new and old modles"
                                              activate (IP routing & show ip route)


2.1- SVI "switched virtual interface"
     --------------------------------
SW(config)# interface vlan 10
SW(config-if)# ip address 10.0.0.1 255.0.0.0
SW(config-if)# no shutdown
                 To Have a working SVI we have some condetions 
                     1- MLS "IP routing active"
                     2- VLAN must be active before taking ip address 
                          > after activeting the VLAN its interface to come to up - up state:
                             1- phisical interface assigned to the VLAN 
                                (Access, Trunk "allawed list")
                             2- VLAN or VLAN interface are not shutdown or deleted 


2.2- routed interface                         >>>>> (used for point to point connections)
   ------------------
SW(config)# int g0/0
SW(config-if)# no switchport
SW(config-if)# ip address 10.0.0.1 255.0.0.0

-------------------------------------------------------------------------------------------------

SW# show ip route
      C          10.145.76.0/23 is directly connected, GigabitEthernet0/1
      L          10.145.76.0/32 is directly connected, GigabitEthernet0/1
SW# show ip route | inc vlan700
SW# show ip route | inc 700
      C          10.145.76.0/23 is directly connected, Vlan700
      L          10.145.76.0/32 is directly connected, Vlan700

SW# show interfaces status           >>>>> virefy routed interfaces under vlan column
SW# show ip interface brief          >>>>> virefy routed interfaces IP address
SW# show run interface gi1/0/1       >>>>> virefy no switchport command 
SW# show interfaces g0/1             >>>>> virefy routed interfaces IP address
SW# show interfaces g0/1 switchport  >>>>> MLS Switchport: status "Enabled, Disabled"

===========================================================================================================
===========================================================================================================

>> SDM Templates (switching database manager): 
   ===========================================
   - importance of choosing suteble sdm-temp if TCAM table memory has limited resources, when a section of a HW is full, all processing overflow is sent to CPU cuasing impact to the performance 
   - Resources allocatoin ratios between the various TCAM tables are stored and can be modified with switching Database Manager (SDM) templates
      --------------------
       (config)# sdm prefer {vlan | advanced}    >>>>> the switch must be restored with reload command 
                                                       . every switch in the stack must be configured with the same SDM template
       # show sdm prefer
      --------------------
   - the number of feature resources allowed by templates vary based on the switch platform or software version in use 
   - the template that's used depends on the function that this switch deployed for in the network 

===========================================================================================================
===========================================================================================================

>> Spanning Tree protocol (STP)
   ============================
IEEE 802.1D (STP)
IEEE 802.1W (RSTP)
Cisco PVST+
Cosco Rapid PVST+
IEEE 802.1S (MST) (group of VLANs)

PVST+, RSTP, MST are backward compatible with 802.1D
--------------------------------

Port types:
----------
1) point to point > port connected to (PC, RSTP switch)
2) P2P edge       > port fast enabled "end devices"

--------------------------------

>> Rapid Spanning Tree protocol (RSTP) 
   ===================================

>> Per VLAN Spanning Tree Protocol (PVST)
   ======================================
   - PVST to work on switch connection between switches must be on trunk mode 
BID:
6 byte system ID (MAC Address)
2 byte periority (32768)
   - System ID Extension (12 bits) (VLAN ID)
   - Bridge Priority (4 bits)
     2^4 = 16 posability 
           32768  16384  8192  4096
 0     >>    0       0      0    0
 -     >>    -       -      -    -
 61440 >>    1       1      1    1

----------------------------------
ST Mode:
--------
s(config)# spanning-tree mode pvst

Root SW:
-------- 
s(config)# spanning-tree vlan 4-22 root (primary, secondary) [diameter diameter]  >>>>> set primary and secondary root (24576 | 28672), diameter reference the max # of L2 hops between a switch and the root-sw (the range 2 to 7), it impact on the timers value for optimal convergence 
s(config)# spanning-tree vlan 4-22 priority 0                                     >>>>> set BID Priority

Port Cost:                                         >>>>> cost computed by defualt based on the operating speed of the link not the maximum speed
----------
s(config-if)# spanning-tree vlan 4 cost 100              >>>>> change cost for spesefic VLAN
s(config-if)# spanning-tree cost 100                     >>>>> change cost for all VLANs

Port Priority: >>>>> must be 16 multipliers 
-------------
s(config-if)# spanning-tree vlan 4 port-priority 16     >>>>> change priority for spesefic VLAN  
s(config-if)# spanning-tree port-priority 16            >>>>> change priority for all VLANs

-----------------------------
> Spanning tree path cost:
  -----------------------
   1) short mode "default mode", 16-bit, reference speed value "20-Gbps"
   2) long mode, 32-bit, reference speed value "20-Tbps"

s(config)# spanning-tree pathcost method long           >>>>> activate new port cost standerd 
                                                              . entire L2 topology should use the same setting for every device

-----------------------------

*# show spanning-tree                          >>>>> if tyoe field includes *TYPE_Inc-, this indicates a port configuration mismatch  "incorrect port type (access vs trunk)"
*# show spanning-tree vlan 4                   >>>>> if tyoe field includes *TYPE_Inc-, this indicates a port configuration mismatch  "incorrect port type (access vs trunk)"
*# show spanning-tree detail
*# show spanning-tree vlan 4 detail            >>>>> check topology changes "TCN-PBDU"
 # show spanning-tree summary                  >>>>> ports status per vlan
 # show spanning-tree vlan 4 bridge
 # show spanning-tree vlan 4 root
 # show spanning-tree root                      >>>>> root-sw details for every vlan, root port inclouded for non root sw only 
 # show spanning-tree interface f0/1 [details]  >>>>> check allowed vlans on trunk port  

--------------------------------

Max Age:                       || Max-Age >= 2*(Hello-Time + 1)
-------- 
s(config)# spanning-tree vlan vlan-id max-age maxage

Hello time: 1 to 10            || Max-Age >= 2*(Hello-Time + 1)
----------
s(config)# spanning-tree vlan vlan-id hello-time hello-time

forward delay: 15 to 30 sec    || 2 * (Forward-Time - 1) >= Max-Age >= 2 * (Hello-Time + 1)
-------------
s(config)# spanning-tree vlan vlan-id forward-time forward-time 



===========================================================================================================
STP Features:   (Port fast, BPDU gard, Etherchannel)
=============
=============


1 >> Port Fast:             >>>>> feature for STP and PVST only to bypass unneeded listning and lerning states on end devises (30sec) to become fowrward port
    ==========                    (end divices don't cause loops) (rapid protocols don't need it)
                                
 - conditions to activate port fast feature 
   1. port connected to single host
   2. port on access mode 


  - Portfast can be enabled on trunk links with the command 
    -------------------------------------------------------
      s(config-if)# spanning-tree portfast trunk

    However, this command should be used only with ports that are connecting to a single host 
    (such as a server with only one NIC that is running a hypervisor with VMs on different VLANs). 
    Running this command on interfaces connected to other switches, bridges, and so on can result in a bridging loop. 


  - enable portfast (one specific access interface)
    -----------------------------------------------
     s(config)# int f0/1
     s(config-if)# switchport mode access
     s(config-if)# spanning-tree portfast

     disable
     -------
      s(config-if)# spanning-tree portfast disable



  - enable portfast (globle on all access ports)
    --------------------------------------------
     s(config)# spanning-tree portfast defult

     disable
     -------
      s(config)# no spanning-tree portfast defult


-------------------------------------------------------

    # show spanning-tree vlan 10                     >>>>> check if port fast enabled (P2p Edge) 
    # show spanning-tree interface f0/1 portfast
    # show spanning-tree interface f0/1 details      >>>>> check if port fast enabled & BPDU Guard
    # show interfaces status                         >>>>> check errdisabled interfaces 


===========================================================================================================



2 >> BPDU Guard:   >>>>> secure the ports that works as port fast (disable the port if BPDU msg recived)
    ===========

enable BPDU Guard (one interface)
---------------------------------
s(config)# int f0/1
s(config-if)# spanning-tree bpduguard enable

disable
-------
s(config-if)# spanning-tree bpduguard disable


enable BPDU Guard (globally on all STP portfast ports)
------------------------------------------------------
s(config)# spanning-tree portfast bpduguard defult

disable
-------
s(config)# no spanning-tree portfast bpduguard defult

-----------------------------------------------------------------------
Automatic Recovery: 
------------------
s(config)# errdisable recovery interval 30          >>>>> (Defult 5min to recover after the second command but you can change it with the 1st command)
s(config)# errdisable recovery cause bpduguard  
or 
shut and no shut for the interface 


  # show errdisable recovery                          >>>>> check enabled errdisable reason

------------------------------------------------------------------------

# show spanning-tree int f0/1 portfast
# show spanning-tree int f0/1 details      >>>>> check if port fast enabled & BPDU Guard
# show interfaces status                   >>>>> check errdisabled interfaces 


===========================================================================================================
===========================================================================================================


3 >> Layer 2 Etherchannel:  (Etherchannel, Port channel, Channel-group, LAG "link aggregation group" )
     ====================
 - groups multiple interfaces together to act as single interface, STP will treat this group as a single interface 
 - physical interface per device for load balancing 

   Static EtherChannel "manually" 
   ----------------------------
     s(config-if)# channel-group etherchannel-id mode on

   Dynamically LACP EtherChannel: 
   -----------------------------  
     s(config-if)# channel-group etherchannel-id mode {active | passive}

   Dynamically PAgP EtherChannel: 
   -----------------------------  
     s(config-if)# channel-group etherchannel-id mode {auto | desirable} [non-silent]


       - LACP-Port Aggregation protocol (cisco prop)
          auto - auto       >> etherchannel will not work 

      - LACP-Link Aggregation control Protocol (IEEE standerd 802.3ad)
         passive - passive >> etherchannel will not work 

  -------------------------------------------------------------

   Configuration checks before adding interfaces to etherchannels:
   --------------------------------------------------------------
    1- port type (L2/L3)
    2- Duplex
    3- speed
    4- port mode (all must be "access/trunk")
    5- allowed vlans (for trunk interfaces)
    6- native vlans  (for trunk interfaces)
    7- the access vlan (for access interfaces)
    8- STP interface settings
    9- MTU "for L3 int"
   10- Load interval
   11- storm control  

    - If configuration no matched at one interface (interface status "suspended")
      . to recover the interface to the etherchannel, correct the error, shut no shut to this interface or to the etherchannel port 


  -------------------------------------------------------------

   Configuration:
   -------------
     s(config)# int range f0/1-8
     s(config-if)# channel-protocol pagp           > (optional)
     s(config-if)# channel-group 1 mode desirable  > (group # not improtant to match at both sw)

     s(config)# int port-channel 1   (int PO1)
     s(config-if)# switchport mode trunk

     -------------

     s(config)# port-channel load-balance ?       >>>>> spacify the inputs that the algorithm will use for load balance calculation 
                                                     (src, dst, src-dst)---(MAC, IP, Port)

     -------------
       s# show etherchannel load-balance            >>>>> view the port-channel hash algorithm
       s# show etherchannel port                    >>>>> view load on each member link 

      -------------
    Show:
     # show spanning-tree vlan 3
    *# show etherchannel summary         >>>>> P(in port-channel) active and working, D(down), I(stand-alone) peer not active, s(suspended) interface config not match
    *# show etherchannel # summary
     # show etherchannel 2 port-channel
     # show etherchannel
     # test etherchannel load-balance interface po1 mac 0200.0000.0001 0200.1111.1111
     # test etherchannel load-balance interface port-channelnumber{ip | l4port | mac} [source_ip_add|source_mac_add|source_l4_port] [dest_ip_add|dest_mac_add|dest_l4_port]
     -------------
    *sw# show interfaces port-channel "port-channel-id"        >>>>> po total BW, member ints, 
     sw# show etherchannel port                                >>>>> much information 
     sw# show lacp neighbor [detail]                           >>>>> neighbors system-ID, system priority, fast/slow LACP 
     sw# show lacp system-id                                   >>>>> local LACP system ID
     sw# show pagp neighbor                                    >>>>> neighbors sys-ID, remote port number, fast/slow PAGP

     sw# show lacp counters                                     >>>>> verify that the LACP packet are being transmitted fom po members
     sw# clear lacp counters

     sw# show pagp counters                                     >>>>>> verify that the PAGP packet are being transmitted fom po members
     sw# clear pagp counters

 ----------------------------------------
   LACP advanced configuration:
   ----------------------------
    sw(config-if)# lacp rate fast                              >>>>> send LACP evry 1 sec insted of 30 sec "detect errors faster" "down after 3 intervals"
    sw# show lacp internal                                     >>>>> verifying lacp speed  

    sw(config-if)# port-channel min-links "min-links"          >>>>> set a min for etherchannel to work 
    sw(config-if)# lacp max-bundle max-links                   >>>>> set a max but not as condition for operation 
    sw# show etherchannel summary

    sw(config)# lacp system-priority priority                  >>>>> master switch deciding active members based on (1. lower port-priority 2.lower int-id #)
                                                                      . master switch is the switch with lower system priority 
    sw# show lacp sys-id                                       >>>>> check system priority 

    sw(config-if)# lacp port-priority priority                 >>>>> set the interface priority for the portchannel members
    sw# show etherchannel summary | b Group


===========================================================================================================
===========================================================================================================

4 >> L3 Etherchannel:  >>>>> take ip address, no need for STP, LB for traffic, save ip address
     ===============

sw(config)# ip routing
-----------------
sw(config)# interface range f0/1-4
sw(config-if)# no switchport
sw(config-if)# channel-group 1 mode desirable

sw(config)# int po1
sw(config-if)# ip address 10.0.0.1 255.0.0.0

----------------------------

# show run
# show ip int br 
# show etherchannel summary
# show interfaces port-channel 1   >>>>> check L3 etherchannel IP address
# show interfaces atatus           >>>>> validat routed interfaces
# show ip route

===========================================================================================================

STP Features:  (Root Guard - BPDU Filter - STP Loop Guard - Unidirectional Link Detection)
=============


  >> Root Guard:
     ==========
      - root guard is placed on root-SW DP "designated port" or any other switch DP toward other switches that should never become root -SW
      - port placed in an errdisabled state if a superior BPDU is received 

     -------------------
          s(config)# int f0/1
          s(config-if)# spanning-tree guard root 
     -------------------
             # show interfaces status                   >>>>> check errdisabled interfaces 

===========================================================================================================

  >> BPDU Filter:   >>>>> similar to BPDU guared "filter bpdus"  (((Not recomended as not relaible in real practices)))
     ===========
      - BPDU Filter act in two diffrent secnarios 
      - BPDU filter takes precedence over BPDU Guard on the port 
 

   - Global BPDU filter command
     ---------------------------
       s(config)# spanning-tree portfast bpdufilter default   >>>>> enable BPDU filter on all portfast ports
                                                                     if BPDU are received:
                                                                       . portfast is disabled on the interface
                                                                       . BPDU also disabled
                                                                       . send and recive BPDU normally
                                                                                                           
   - The interface specific BPDU filter
     ----------------------------------
       s(config-if)# spanning-tree bpdufilter enable          >>>>> port does not send any BPDUs and ignore any recived BPDU


  ----------------------------------
        sw# show spanning-tree interface gi1/0/2 detail | in BPDU|Bpdu|Ethernet


===========================================================================================================

  >> Problems with Unidirectional links:
     ==================================
      - unidirectional traffic means traffic can pass in one direction, but not the other (fiber or copper pair damaged)
        . interface protocol still up BPDUs not able to transmit (creating a forwarding loop)

     1 >> STP Loop Guard:
          ==============
           - prevent any alternative"block" or root ports from becoming designated ports due to loss of BPDUs on the root port
           - place port in an errdisabled state till BPDU transmission start again and recover 


           - Loop Guard is enabled globally by using the command:
             ---------------------------------------------------
               S(config)# spanning-tree   loopguard   default 


           - Loop Guard is enabled on an interface with the interface command:
             -----------------------------------------------------------------
               S(config-if)# spanning-tree   guard   loop


         ----------------------------
                    S# show spanning-tree vlan 1 | b interface       >>>>> check stp loop guard and if there is a loop inconsistant occaured 
                                                                              Type > P2p *LOOP_Inc
                    S# show spanning-tree inconsistentports          >>>>> Inconsistent ports are viewed with the command
                     # show interfaces status                        >>>>> check errdisabled interfaces 
===========================================================================================================

     2 >> Unidirectional Link Detection:
          =============================
           - allows for the bidirectional monitoring on fiber cables by sending and receiving continues UDLD packets, includes (interface system ID and Port ID)
           - if no packet transmitted "frame not acknowledged" UDLD take action based on the operational mode 
              . Normal     >> port considered undetermined and the port remains active
              . Aggressive >> send 8-packets in one sec if not ack port placed in error state 


           - UDLD is enabled globally with the command:
             -----------------------------------------
               S(config)# udld enable [aggressive]   >>>>> This enables UDLD on any small form-factor pluggable (SFP)-based port
                


           - UDLD can be disabled on a specific port with the interface configuration command:
             ---------------------------------------------------------------------------------
                S(config-if)# udld port disable 


           - UDLD recovery can be enabled with the command:
             ---------------------------------------------
                S(config)# udld recovery [interval time]   >>>>> where the optional interval keyword allows for the timer to be modified from the default value of 
                                                                  5 minutes
                   

           - UDLD can be enabled on a port-by-port basis with the interface configuration command: 
             ------------------------------------------------------------------------------------
                S(config-if)# udld port [aggressive]     >>>>> where the optional aggressive keywork places the ports in UDLD aggressive mode
     


    - UDLD must be enabled on the remote switch as well, once it is configured, the status of UDLD neighborship can be verified with the command:  
           ------------------------------------------------------------
            S# show udld neighbors 

    - More detailed information can be viewed with the command 
          --------------------------------------------------------
            S# show udld interface-id

                     # show interfaces status                        >>>>> check errdisabled interfaces 

===========================================================================================================

>> MST
   ===
   1) Define MST as the spanning tree protocol with the command 
      ------------------ 
        S(config)# spanning-tree mode mst
      ------------------ 

   2) (optional) Define MST instance priority, using one of two methods: 
      ------------------ 
       1- 
         S(config)# spanning-tree mst "instance-number" priority "priority"
          . The priority is a value between 0 and 61440 in increments of 4096
           ------------------ 
       2- 
         S(config)# spanning-tree mst "instance-number" root {primary | secondary} [diameter "diameter"]
          . The primary keyword set the priority to 24576, and the secondary set the priority to 28672
      ------------------ 

   3) Associate VLANs to an MST instance. By default all VLANs are associated to the MST 0 instance 
      - The MST configuration submode must be entered with the command:
      ------------------ 
        S(config)# spanning-tree mst configutation 
         ------------------ 
      - Then the VLANS are assigned to different MST instance with the command:
         ------------------ 
        S(config-mst)# instance "instance-number" vlan "vlan-id" 
      ------------------ 

   4) Specify the mst version number
      - The mst version number must match for all switches in the same MST region
      - The mst version number is configured with the submode configuration command
      ------------------ 
        S(config-mst)# revision "version" 
      ------------------ 

   5) (optional) Define the MST region name
       - MST region are recognized by switches that share a common name
       - By default a region name is an empty string 
       - The MST region name is set with the command
      ------------------  
        S(config-mst)# name "mst-region-name"
      ------------------ 

   ---------------------------------------------
  Ex:
     SW1(config)# spanning-tree mode mst
     SW1(config)# spanning-tree mst 0 root primary
     SW1(config)# spanning-tree mst 1 root primary
     SW1(config)# spanning-tree mst 2 root primary
     SW1(config)# spanning-tree mst configuration
     SW1(config-mst)# name ENTERPRISE_CORE
     SW1(config-mst)# revision 2
     SW1(config-mst)# instance 1 vlan 10,20
     SW1(config-mst)# instance 2 vlan 99

   ---------------------------------------------
       Show:
         S# show spanning-tree mst configuration            >>>>> region name, version #, configured instanses, mapped vlans 
         S# show spanning-tree
         S# show spanning-tree mst [instance-number]
         S# show spanning-tree mst interface "interface-id" 

  ------------------------------------------------------------------------------------------


      Tuning of port cost and port priority:
      -------------------------------------
         S(config-if)# spanning-tree mst "instance-number" cost "cost" 
         S(config-if)# spanning-tree mst "instance-number" port-priority "priority"  
        ------------------
             S# show spanning-tree mst [instance-number]                               >>>>> check cost and priority



===========================================================================================================



===========================================================================================================

>> Static Routing:
   ==============

  1. Static Network Routes (S)
     ---------------------

      !!recursive static route!!
        ----------------------
         R1(config)# ip route  40.0.0.0  255.0.0.0   30.0.0.2
         R1(config)# ip route network subnet-mask next-hop-ip 

      !!directly attached static route!!
        ------------------------------
         R1(config)# ip route  40.0.0.0  255.0.0.0   G0/1
         R(config)# ip route network subnet-mask next-hop-interface-id

      !!Fully specified static routes!!
        -----------------------------
         R(config)# ip route network subnet-mask interface-id next-hop-ip



  2. Static Host Routes (S)  "congestion utilization" (If there is an overlaping choose the most spacefic route "longest prefix length")
     -------------------
        R1(config)# ip route  60.0.0.8  255.255.255.255  G0/2 permanent
                                                           >> permanent "optional keyword" >>>>> use only this path if the path went down drop the data and don't use any alternet path from the RIB table 


  3. Static Default Routes (S*) "gateway of last resort"
     ---------------------
       R2(config)# ip route  0.0.0.0  0.0.0.0  G0/1



  4. Floating Static Routes (S)                                   >>>>>> (change AD for static route to make it less preferred)
     ----------------------                                              (the route will be inactive unless the other route is removed)                                                     
      config)# IP route x.x.x.x  x.x.x.x  x.x.x.x  130  > (backup route)
               - If AD=255 the router does not belive the source of that route and does not install the route in the routing table 
       ----------------
       R# sh ip route ip-address        >>>>> verifying the AD for the floating static route       
       ----------------  

                           
  5. Static Null Routes
     ------------------
      R(config)# ip route 172.16.0.0 255.255.0.0 Null0       >>>>> drop traffic if not matched with the most-spacific routes to avoid loops 

 
  --------------------------------------------------------------------------------------------

   - ECMP (Equal cost multi path) --> Load balance over both routs "in case metrics are equavilint"
   - If AD=255 the router does not belive the source of that route and does not install the route in the routing table 

  --------------------------------------------------------------------------------------------
  Show:
      R# show ip route connected
      R# show ip route static
      R# show ip route 10.132.139.102

===========================================================================================================
===========================================================================================================


>> IPv6 Static Routes
   ==================
R(config)# ipv6 unicast routing        >>>>> enable ipv6 static routing 
R(config)# ipv6 route network/prefix-length { next-hop-interface-id | [next-hop-interface-id] next-ip-address}

R# show ipv6 route

===========================================================================================================
===========================================================================================================

- Ping (Echo reply):
  -----------------
 . successful

 . destination host unreachable >>>>> no path available in the gateway "router" routing table
                                >>>>> ACL deny the packet

 . request time out             >>>>> path available in the gateway "router" routing table but no responce being returned"


===========================================================================================================

>> ARP table:
  ===========
- Mapping for IP-add to MAC-add for remote devices on the same IP network segment 
- routers arp table cashing the mac-add for 240 minutes
- entres with time = (-) means local entry 
-----------
# show ip arp {"mac-add" | "ip-add" | vlan "vlan-id" | interface-id}
# show arp    {"mac-add" | "ip-add" | vlan "vlan-id" | interface-id}


# clear ip arp "MAC-or-IP"

===========================================================================================================


>> VIRTUAL ROUTING AND FORWARDING (VRF) 
   ====================================

The following steps are required to create a VRF and assign it to an interface:

Step 1. R(config)# vrf definition vrf-name              >>>>>>> Create a multiprotocol VRF routing table by using the command 

Step 2. R(config-vrf)# address-family {ipv4 | ipv6}     >>>>>>>> Initialize the appropriate address family by using the command 
                                                                  The address family can be IPv4, IPv6, or both.
Step 3. R(config)# interface interface-id               >>>>>>>> Enter interface configuration submode and specify the interface to be associated with the 
                                                                  VRF instance by using the command 
Step 4. R(config-if)# vrf forwarding vrf-name           >>>>>>>> Associate the VRF instance to the interface or subinterface by entering the command 
               
Step 5. Configure an IP address (IPv4, IPv6, or both) on the interface or subinterface by entering 
               either or both of the following commands:
               --IPv4 --> R(config-if)# ip address ip-address subnet-mask [secondary]
               --IPv6 --> R(config-if)# ipv6 address ipv6-address/prefix-length

   ---------------------------------------
   Show:
   ----
    R# show ip route
    R# show ip route vrf  vrf-name


===========================================================================================================
===========================================================================================================



>> EIGRP:
   =====
R# show ip eigrp topology                            >>>>>>>>>>> (full topology table) show path metric, reported distance RD, fesible distance FD, successor route, feasible successor
R# show ip route eigrp | begin Gateway               >>>>>>>>>>> unequal cost LB "variance"
R# show ip route 10.4.4.0                            >>>>>>>>>>> verifing unequal-cost LB ratio 


===========================================================================================================
===========================================================================================================



>> OSPF:
   =====
   =====

    OSPF default routes                                                           >>>>> O*E2
    OSPF intra-area routes                                                        >>>>> O
    OSPF interarea routes                                                         >>>>> O IA
    OSPF external routes "redistributed" "other domain / other routing protocol"  >>>>>

    ((( area number can be integer or dotted-decimal-number ))) 1603
    ((( 0 ---> 4,294,967,295 ))) 32-bit
  
  - Discover neighbor with Hello message
  - OSPF Default Routes: (O*E2)


   >> OSPF configuration
      ------------------
      ------------------

       1) global configuration:
          --------------------
           - If the wildcard mask octet is 255 the matching address octet should be 0

              R4(config)# router ospf 1                                  >>>>>>>>>>> R(config)# router ospf process-id                                
                                                                         >>>>>>>>>>> defines and initializes the OSPF process
                                                                                     . process ID unique only on the local router
                                                                                     . router support using multiple ospf process (1 --> 65535) 16-bit
                                                                                     . process ID can be different on each router  
              R4(config-router)# network 10.1.14.0  0.0.0.255  area 0    >>>>>>>>>>> R(config-router)# network ip-address wildcard-mask area area-id.
              R4(config-router)# network 10.1.14.3  0.0.0.0  area 0
                                                                                        1. enable ospf on the interfaces
                                                                                        2. discovers neighbors & create neighbor relationships
                                                                                        3. assign the interface to the area listed in the command
  
           - match all the interfaces
             ------------------------
              R1(config)# router ospf 1
              R1(config-router)# 0.0.0.0  255.255.255.255 area 0




       2) OSPF Interface configuration:
          ----------------------------
              R(config)# interface G0/1
              R(config-if)# ip ospf 1 area 0                              >>>>>>>>>> R(config-if)# ip ospf process-id area area-id [secondaries none] 
                                                                         (( This method also adds secondary connected networks to the LSDB unless the secondaries none option is used ))
            ------------------
              R(config-if)# ip ospf process-id area area-id [secondaries none]  >>>>> the command adds secondary connected networks to the LSDB unless the secondaries none option is used 


    ---------------------------------------------------------------------------------

   >> config shows:
      ------------
      ------------

         R# show running-config
       * R# show ip protocols                         >>>>>>>> interface Attached to ospf via ("Network statement" "Inerface enabled")

     enabled interfaces sh:                      >>>>>>>> displays the OSPF-enabled interfaces
     ---------------------
       * R# show ip ospf interface brief              >>>>>>>> Interface, PID "process-ID", Area ID , Network/mask, Cost, state, Nbrs F/C (full adjacent neighbors / neighbors count)
         R# show ip ospf interface                    >>>>>>>> lists all the OSPF-enabled interfaces, the IP address associated with each interface, the RID for the DR and BDR 
                                                              (and their associated interface IP addresses for that segment), and the OSPF timers for that interface.
       * R# show ip ospf interface interface-id       >>>>>>>> interface Attached to ospf via ("Network statement" "Iterface enabled")
         R# show ip ospf interface | i Timer|line     >>>>>>>> Verifying OSPF Timers
   

     neighbors sh:
     -------------
       * R# Show ip ospf neighbor                    >>>>>>>> Interface "local-int", Address "neighbor-add", state "5 cases for neighbor state"
                                                                                                               Full/- (not a BC network)
                                                                                                               Full/ {DR, BDR, DRother}
                                                                                                               2Way/ DRother
         R# Show ip ospf neighbor "type number"
         R# Show ip ospf neighbor [detail]

     LSDB sh:
     --------
         R# Show ip ospf database                     >>>>>>>> Generic router LSA output "LSA Types"
         R# show ip ospf database router              >>>>>>>> Type 1 LSAs for an area are shown with the command
         R# show ip ospf database network             >>>>>>>> Detailed type 2 LSA information is shown with the command
         R# show ip ospf database summary             >>>>>>>> Detailed type 3 LSA information is shown with the command
         R# show ip ospf database summary [network prefix]   > The output can be restricted to a specific LSA by appending the 
                                                                network prefix to the end of the command


     OSPF local RIB:
     ---------------
         R# show ip ospf rib 

     routes sh:
     ----------
         R# Show ip route
         R# Show ip route ospf
         R# Show ip route ospf | begin Gateway
         R# Show ip route "subnet mask"
         R# Show ip route | section "subnet"

    ---------------------------------------------------------------------------------

   >> Configuring the OSPF router ID:
      ------------------------------
      ------------------------------

      Each router chooses its OSPF RID when 
       1- OSPF is initialized when the router boots
       2- Admin from CLI stop & restarts the ospf process 

      ---------------------------

             1) Router ID                                                    >>>>> RID must be uneque for every router 
               R(config)# router ospf 1
               R(config-router)# router-id   1.1.1.1                         >>>>> R(config-router)# router-id router-id 
                                                                             >>>>> statically assigns the OSPF RID under the OSPF process

             2) Highest Loopback ip                                          >>>>> (virtual interface always in up/up unless you shut it down manually)
               R(config)# int loopback 0
               R(config-if)# ip address 1.1.1.1  255.0.0.0
                          ---------                                          >>>>> activate OSPF on the loopback interface as well
               R(config)# router ospf 1
               R(config-router)# network 1.1.1.1  0.0.0.255  area 0

             3) Highest non-Loopback ip (up/down)

    -----------------------------

        R# clear ip ospf process                                     >>>>>>>>>>>>> restarts the OSPF process on a router so that OSPF can use the new RID
                                                                                    . It clears all the data and routs learned by OSPF
        R# show ip ospf                                                >>>>>>>>>>>>> show Router-ID 
        R# show ip protocols                                           >>>>>>>>>>>>> show Router-ID 

    ---------------------------------------------------------------------------------

   >> OSPF Networks:
      -------------
      -------------


       1) OSPF Broadcast Network Type:
          ---------------------------


          >> DR & BDR & DR other election:
             ----------------------------
             - Each router elect when 
                1- OSPF is initialized when the router boots
                2- Admin from CLI stop & restarts the ospf process 
             - to avoid BC storm & loops & congestion
             - OSPF by default use broadcast network type on all typs of Ethernet interfaces 
             - If the DR fails, the BDR become the DR and new BDR is elected
             - when a better router enters the subnet, no preemption of the existing DR or BDR occurs


             1- the highest OSPF interface priority (0-->255)   >>>>> Default priority = 1 "ethernet cables"
                ---------------------------------------------
                  R(config)# int g0/0
                  R(config-if)# ip ospf priority 0-255


                  R# show ip ospf interface brief                        >>>>> to determine the interface role
                  R# Show ip ospf neighbor                               >>>>> Verifying DR Manipulation
                  R# show ip ospf interface g0/0                         >>>>> verifying network type, priority, state DR,BDR,DRother
                  R# show ip ospf interface g0/0/0 | include priority

             2- the highest OSPF router ID 
                --------------------------


           -----------------------------------------------
            R(config)# int g0/0
            R(config-if)#ip ospf network broadcast                       >>>>> overrides the automatically configured setting and 
                                                                               statically sets an interface as an OSPF broadcast network type


    ---------------------------------------------------------------------------------

       2) OSPF Point-to-Point Network Type:
          --------------------------------
          --------------------------------

          - Serial link
            .data-link protocols used on serial link are ( HDLC & PPP ) both do not support data link broadcast

               R(config)# int g0/0
               R(config-if)# ip ospf network point-to-point           >>>>> change ethernet to point to point 

               R# show ip ospf interface g0/0                         >>>>> verifying network type, priority, state DR,BDR,DRother
               R# show ip ospf interface s0/1 | include Type



===========================================================================================================
===========================================================================================================



>> OSPF Features:
   =============

    1- OSPF Passive Interfaces: (no neighbor discovery hello being sent, no processing for received hellos)
       -----------------------  ( OSPF continues to advertise about the subnet that is connected to the interface)
       -----------------------

        1)
          R(config)# router ospf 1
          R(config-router)# passive-interface g0/0
        2)
          R(config)# router ospf 1
          R(config-router)# passive-interface default
          R(config-router)# no passive-interface g0/0

         --------------------
             R# show ip ospf interface g0/0
             R# show ip protocols 

    -----------------------------------------------------------    -----------------------------------------------------------

    2- Failure Detection  (((( intervals must synchronize between neighbors "peers" ))))
       -----------------
       -----------------

          R(config)# int g0/0
          R(config-if)# ip  ospf  hello-interval  1–65535
          R(config-if)# ip  ospf  dead-interval  1–65535      >>>>>>>>>> dead-interval = 4 X hello-interval

          -----------

          R# show ip ospf interface
          R# show ip ospf interface g0/0
          R# show ip ospf interface | i Timer|line            >>>>>>>>>> Verifying OSPF Timers


    -----------------------------------------------------------    -----------------------------------------------------------

    3- OSPF Default Routes: (O*E2)
       -------------------
       -------------------

          R(config)# ip   route   0.0.0.0   0.0.0.0   192.0.2.1  

          R(config)# router ospf 1
          R(config-router)# default-information originate always           >>>>>>>>> The default route is advertised by using the command

          R(config-router)# default-information originate [always] [metric metricvalue] [metric-type type-value]                                                                           
                                                                                    - Always key word > advertise the defualt route even if it went down "not exist in the RIB"
                                                                          


    -----------------------------------------------------------    -----------------------------------------------------------


    4- OSPF Metrics (cost):  (port cost "BW")
       -------------------
       -------------------

       1) cost:
          -----
          R(config)# int g0/0
          R(config-if)# ip ospf cost 1–65535

          R# show ip ospf interface brief
          R# show ip ospf interface interface-id

       2) interface bandwidth:
          -------------------
          R(config)# int g0/0
          R(config-if)# ip ospf bandwidth 50   (Kbps)

       3) reference OSPF bandwidth:   >>>>> cost = reference BW / interface BW  || (defualt refrence-BW = 100,000 kbps)
          ------------------------    >>>>> change the reference BW to 100,000 Mbps to solve the legacy standerd 
          R(config)# router ospf 1
          R(config-router)# auto-cost reference-bandwidth bandwidth-in-Mbps


    -----------------------------------------------------------    -----------------------------------------------------------


    5- OSPF Load Balancing: (controlled by the paths cost manipulation)
       -------------------
       -------------------

          LB Types: 
              1)Per-packet                     >>>>> no prefered "cause an overhead to routers"
              2)Per-destination IP address     >>>>> prefered

       --------------------
             R# show ip protocols                 >>>>> show macimum paths configured for LB
                                                  >>>>> "maximum-paths by default =4 defferent routes"


          ECMP (equal cost multi path):
          -----------------------------
          R#(config)# router ospf 1
          R#(config-router)# maximum-paths  6   >>>>> "multiple equal-cost routes"


    -----------------------------------------------------------    -----------------------------------------------------------


    6- Troubleshooting OSPF:
       --------------------
       --------------------

       - OSPF Neighbor Requirements: 
                 R# Show ip ospf neighbor
           . check if both routers using OSPF "configured"
           . check passive interfaces
           . Interfaces must be in an up/up state
           . Access control list (ACL) must not filter routing protocol messages
           . Interfaces must be in the same subnet 
           . They must pass routing protocol neighbor authentication (if configured)
           . Hello and hold/dead timers must match
           . Router IDs (RID) must be unique
           . They must be in the same area
           . OSPF process must not be shut down
         - OSPF Neighboring work but OSPF not operating fine (impact on the layer3 packet MTU "maximum transmission unit" size missmatsh)
           . Neighboring interfaces must use same MTU setting  
         - OSPF Neighboring work but OSPF not operating fine (impact on the LSA sent "receving LSA type1 and expect LSA type2")  
           . Neighboring interfaces must use same OSPF network type
         -
       . DR enablement must match for the segment 
       . area type flags must match for the segment (stub, NSSA)

       ------------------------------------------

       - minimum frame size = 64 bytes & maximum frame size 1518 bytes
       - Layer3 packet MTU size= 1500 bytes
       R(config)# int g0/0
       R(config-if)# ip mtu #
       R(config-if)# ipv6 mtu #

       # show interfaces gi0/0/1 | include MTU  
       # show ip ospf interface g0/0           >>>>> Hello and dead timers, RID check, if pass any neighbor authentication, 
                                                      ospf process must not be shut down, show passive interfaces 
       # show ip ospf interface brief          >>>>> area check
       # show ip protocols                     >>>>> show passive interfaces

-----------------------------------------------------------




===========================================================================================================
===========================================================================================================



>> OSPF Summarization of routes
   ============================

   >> Configuration of Interarea Summarization
      ----------------------------------------
      ----------------------------------------

       R(config)# router ospf 1
       R(config-router)# area "area-id" range "network" "subnet-mask" [advertise | not-advertise] [cost "metric"]       >>>>> To define the summarization range and associated area
                                                                                                                              . "under the OSPF process on the ABR"
                                                                                                                              . by default advertise keyword executed 
                                                                                                                              . the metric = the lowest metric in the supressed prefixes 
       R(config)# interface Null0                       >>>>> drop traffic if not matched with the most-spacific routes to avoid loops 
       R(config-if)# ip ospf 1 area 0 

   -----------------------------------------------------------   -----------------------------------------------------------

>> OSPF Route filtering
   ====================
   - manipulate traffic flows, reduce memory utilization, improve security
   - filtering of routes generally occurs as routes enter the area on the ABR

   1) Filtering with Summarization
      ----------------------------
      ----------------------------
      - filter type 1 LSA from being generated "filtering limeted to the sorce/local area ABR"

       R(config)# router ospf 1
       R(config-router)# area "area-id" range "network" "subnet-mask" not-advertise



   2) Area Filtering
      --------------
      --------------
      - filtering for type 3 LSA generation in both direction "filtering occurs at any ABR generats the type-3 LAS"
      - in/out depend on the area prespective for the advertisement  

       R(config)# router ospf 1
       R(config-router)# area "area-id" filter-list  prefix  "prefix-list-name" {in | out}

    ---------------------------------------
     Ex:
           R(config)# ip prefix-list PREFIX-FILTER seq 5 deny 172.16.1.0/24
           R(config)# ip prefix-list PREFIX-FILTER seq 10 permit 0.0.0.0/0 le 32
           !
           R(config)# router ospf 1
           R(config-router)# router-id 192.168.2.2
           R(config-router)# network 10.12.1.0 0.0.0.255 area 12
           R(config-router)# network 10.23.1.0 0.0.0.255 area 0
           R(config-router)# area 0 filter-list prefix PREFIX-FILTER in



   3) Local OSPF Filtering
      --------------------
      --------------------
      - filter specific route from spacific router "route exist in the LSDB but not in the RIB"
      - filter using "Distribute List" brfore the RIB & after the LSDB 
        . Should not be used for filtering of prefixes between areas

       R(config)# router ospf 1
       R(config-router)# distribute-list {"acl-number" | "acl-name" | prefix "prefix-list-name" | route-map "route-map-name"} in

         ip access-list standard ACL-OSPF-FILTER
         deny 172.16.3.0
         permit any
         !
         router ospf 1
         router-id 192.168.2.2
         network 10.12.1.0 0.0.0.255 area 12
         network 10.23.1.0 0.0.0.255 area 0
         distribute-list ACL-OSPF-FILTER in



-------------------------
R# show ip route ospf | begin Gateway        >>>>> Verifying Filtering Action Effict 



===========================================================================================================
===========================================================================================================



>> OSPFv3:  
   ======
    OSPF intra-area routes     >>>>> O
    OSPF interarea routes      >>>>> OI

   - support IPv4 & IPv6
   - OSPFv3 not backward compatible with OSPFv2


   > Configurations:
     --------------
     --------------

     The process of configuring OSPFv3 involves the following steps:
     Step 1. 
        . Initialize the routing process. 
        . As a prerequisite, IPv6 must be enabled on the router.
           --------------------
           R(config)#ipv6 unicast-routing
           --------------------

        . Afterward, the OSPFv3 process is configured with the command. 
           --------------------
           R(config)# router ospfv3 ["process-id"]
           --------------------

     Step 2. 
        . Define the router ID. 
        . To assigns a router ID to the OSPF process. 
           --------------------
           R(config-router)# router-id router-id
           --------------------
        . The router ID is a 32-bit value that does not need to match an IPv4 address. 
        . It may be any number, as long as the value is unique within the OSPF domain.
        . OSPFv3 uses the same algorithm as OSPFv2 for dynamically locating the RID. 
        . If there are not any IPv4 interfaces available, the RID is set to 0.0.0.0 and does not allow 
          adjacencies to form.

     Step 3. (Optional) 
        . Initialize the address family. 
        . The address family is initialized within the routing process with the command 
           --------------------
          R(config-router)#address-family {ipv6 | ipv4} unicast
           --------------------
        . The appropriate address family is enabled automatically when OSPFv3 is enabled on an interface.

     Step 4. 
        . Enable OSPFv3 on an interface. 
           --------------------
           R(config-if)# ospfv3 process-id ipv6 area area-id
           --------------------
        . The interface command enables the protocol and assigns the interface to an area.


   ---------------------------
     . Earlier versions of IOS  (These commands are considered legacy)
       -----------------------
        R(config)# ipv6 router ospf                       >>>> for initialization of the OSPF process
        R(config-if)# ipv6 ospf process-id area area-id   >>>> for identification of the interface



   ------------------------------------------------------   ------------------------------------------------------


     > OSPFv3 Verification: (Interfaces, neighborship, routing table)
       -------------------
       -------------------

         R# show ospfv3 ipv6 neighbor             >>>>>> verifying neighbor adjacency
         R# show ospfv3 interface [interface-id]  >>>>>> verifying the OSPFv3 interfaces "adjacent neighbor router"
         R# show ospfv3 interface brief           >>>>>> A brief version of the OSPFv3 interface settings "AF > Address family"
         R# show ipv6 route ospf                  >>>>>> verifying routing table


   ------------------------------------------------------   ------------------------------------------------------



   > OSPFv3 Passive Interface:
     ------------------------
     ------------------------

     - The command is placed under the
 
     1) OSPFv3 process (( Placing the command under the global process cascades the setting to both address families ))
        ---------------
        R(config)# router ospfv3 1
        R(config-router)# passive-interface GigabitEthernet0/1          >>>>>>> An interface is marked as being passive

        R(config)# router ospfv3 1
        R(config-router)# passive-interface default                     >>>>>>> globally with passiveinterface default
        R(config-router)# no passive-interface GigabitEthernet 0/3      >>>>>>> interface is marked as active


     2) or under the specific address family  
        -----------------------------------
        R(config)# router ospfv3 1
        R(config-router)# address-family {ipv6 | ipv4} unicast
        R(config-router-af)#

  ---------------------------
   R# show ospfv3 interface gigabitEthernet 0/1 | include Passive  >>>>>>> The active/passive state of an interface is verified

   ------------------------------------------------------   ------------------------------------------------------


   > OSPFv3 Summarization:
     --------------------
     --------------------

      R(config-router-af)# area area-id range prefix/prefix-length 
      under the address family
      (2001:db8:0::1/128, 2001:db8:0::2/128, and 2001:db8:0::3/128)

      R(config)# router ospfv3 1
      R(config-router)# address-family ipv6 unicast
      R(config-router-af)# area 0 range 2001:db8:0:0::/65

      ---------------------------
        R# show ipv6 route ospf | begin Application           >>>>>> Routing Table verification 

   ------------------------------------------------------   ------------------------------------------------------



   > OSPFv3 Network Type
     -------------------
     -------------------

      R# show ospfv3 interface GigabitEthernet 0/3 | include Network   >>>>>> Viewing the Dynamic Configured OSPFv3 Network Type
      R# show ospfv3 interface brief                                   >>>>>> Viewing the Dynamic Configured OSPFv3 Network Type
      ---------------------------
      R2(config)# interface GigabitEthernet 0/3                        >>>>>> Changing the OSPFv3 Network Type
      R2(config-if)# ospfv3 network { point-to-point | broadcast }

   ------------------------------------------------------   ------------------------------------------------------



   > IPV4 SUPPORT IN OSPFV3
     ----------------------
     ----------------------

      Step 1. Ensure that the IPv4 interface has an IPv6 address (global or link local) configured.
      Step 2. Enable the OSPFv3 process for IPv4 on the interface with the command ospfv3 process-id ipv4 area area-id.

      R1(config)# interface Loopback 0
      R1(config-if)# ospfv3 1 ipv4 area 0
      R1(config-if)# interface GigabitEthernet0/1
      R1(config-if)# ospfv3 1 ipv4 area 0

      ---------------------------

        R# show ip route ospfv3 | begin Gateway  >>>>>> Verifying IPv4 Route Exchange with OSPFv3
        R# show ospfv3 interface brief           >>>>>> Listing of OSPFv3 Interfaces and Their Address Families
        R# show ospfv3 neighbor                  >>>>>> Verifying OSPFv3 IPv4 Neighbors




===========================================================================================================
===========================================================================================================





>> BGP "Border Gateway Protocol":
   =============================
   =============================

R# show tcp brief   >>>>>> shows an established BGP session
                    >>>>>> displays the active TCP sessions between a router

--------------------------------------------------------------------------------

>> The following steps show how to configure BGP:
   ---------------------------------------------
Step 1.
R(config)# router bgp as-number                              >>>>>>>>> Initialize the BGP routing process
Step 2. (Optional) 
R(config-router)# bgp router-id router-id                    >>>>>>>>> Statically define the BGP router ID (RID)=Just Like IP V4 or V6 => Loopback Int
Step 3. 
R(config-router)# neighbor ip-address remote-as as-number    >>>>>>>>> Identify the BGP neighbor’s IP address and autonomous system number

R(config-router)# no bgp default ipv4-unicast                >>>>>>>>> disables the automatic activation of the IPv4 AFI so that steps 4 and 5 are required

Step 4.
 R(config-router)# address-family afi safi                   >>>>>>>>> Initialize the address family
Step 5.
R(config-router-af)# neighbor ip-address/router-id   activate            >>>>>>>>> Activate the address family for the BGP neighbor

-------------------------
R1(config)# router bgp 65100
R1(config-router)# neighbor 10.12.1.2 remote-as 65200

R2(config)# router bgp 65200
R2(config-router)# no bgp default ipv4-unicast
R2(config-router)# neighbor 10.12.1.1 remote-as 65100
!
R2(config-router)# address-family ipv4
R2(config-router-af)# neighbor 10.12.1.1 activate
R2(config-router-af)# exit-address-family

--------------------------------------------------------------------------------

>> Verification of BGP Sessions
   ----------------------------
R# show bgp afi safi summary                                   >>>>>>>>> Verification of BGP Sessions
R# show bgp IPv4 unicast summary                                         Verifying the BGP IPv4 Session Summary (BGP RID, table version) 
                                                                         (Neighbor, V, AS, MsgRcvd, MsgSent, TblVer, InQ, OutQ, Up/Down, State/PfxRcd)
R# show ip bgp summary                                         >>>>>>>>> Earlier commands came out before MBGP and do not provide a structure for 
                                                                         the current multiprotocol capabilities within BGP
R# show bgp afi safi neighbors ip-address                      >>>>>>>>> BGP neighbor session state, timers, and other essential peering information is available
R# show bgp ipv4 unicast neighbors 10.12.1.1                             section1 (Neighbor IP, AS, i|e AS, bgp v, RID, bgp state, timers hold,keepalive)
                                                                         section2 (neighbor cabapility, AF)
                                                                         section3 (messeges sent&recieved)
                                                                         section4 (bgp version)
                                                                         section5 (valid route, connection details&history)  
R# show running-config | section router bgp


IPv6
----
R# show bgp afi safi neighbors ip-address [detail]             >>>>>>>>> displays detailed information on whether the IPv6 capabilities were negotiated successfully
R# show bgp afi safi summary                                   >>>>>>>>> displays a status summary of the sessions, including the number of routes that have been exchanged and the session uptime.

--------------------------------------------------------------------------------
>> Prefix Advertisement
   --------------------
R2(config-router-af)# network network mask subnet-mask [route-map routemap-name] 
R(config-router)# network network mask subnet-mask [route-map routemap-name] 
R(config-router)# network 150.1.77.0/24 mask 255.255.255.0 [route-map XYZ]       >>>>>>>>> advertising IPv4 networks.
                                                                                           The optional route-map provides a method of setting specific BGP PAs
                                                                                           when the prefix installs into the Loc-RIB table.

-------------------------
R1(config)# router bgp 65100
R1(config-router)# bgp log-neighbor-changes
R1(config-router)# neighbor 10.12.1.2 remote-as 65200
R1(config-router)# network 10.12.1.0 mask 255.255.255.0
R1(config-router)# network 192.168.1.1 mask 255.255.255.255

R2(config)# router bgp 65200
R2(config-router)# bgp log-neighbor-changes
R2(config-router)# no bgp default ipv4-unicast
R2(config-router)# neighbor 10.12.1.1 remote-as 65100
!
R2(config-router)# address-family ipv4
R2(config-router-af)# network 10.12.1.0 mask 255.255.255.0
R2(config-router-af)# network 192.168.2.2 mask 255.255.255.255
R2(config-router-af)# neighbor 10.12.1.1 activate
R2(config-router-af)# exit-address-family

------------------------

R1(config)# router bgp 65100
R1(config-router)# bgp log-neighbor-changes
R1(config-router)# neighbor 10.12.1.2 remote-as 65200
R1(config-router)# network 192.168.1.1 mask 255.255.255.255
R1(config-router)# network 192.168.3.3 mask 255.255.255.255
R1(config-router)# network 192.168.4.4 mask 255.255.255.255
R1(config-router)# redistribute ospf 1
R1(config-router)# redistribute connected

--------------------------------------------------------------------------------

>> Receiving and Viewing Routes
   ----------------------------
Loc-RIB
-------
R# show bgp afi safi                                           >>>>>>>>> displays the contents of the BGP database (Loc-RIB) on the router
R# show bgp ipv4 unicast
R# show bgp ipv4 unicast | begin Network

R# show bgp afi safi network                                   >>>>>>>>> displays all the paths for a specific route and the BGP path attributes for that route.
R# show bgp ipv4 unicast 10.12.1.0

R# show bgp afi safi detail                                    >>>>>>>>> displays the entire BGP table with all the path attributes


Adj-RIB-Out
-----------
R# show bgp afi safi neighbor ip-address advertised routes     >>>>>>>>> displays the contents of the Adj-RIB-Out table for a neighbor
R# show bgp ipv4 unicast neighbors 10.12.1.2 advertised-routes

R# show bgp ipv4 unicast summary                               >>>>>>>>> used to verify the exchange of NLRIs between nodes
R# show bgp ipv4 unicast summary | begin Network 


BGP routes in the global IP routing table (RIB)
-----------------------------------------------
R# show ip route bgp                                           >>>>>>>>> The BGP routes in the global IP routing table (RIB) are displayed with the command
R# show ip route bgp | begin Gateway
R# show running-config | section router bgp



IPv6:
-----
R# show bgp afi safi                                           >>>>>>>>> shows the IPv6 unicast BGP tables for R1, R2, and R3. 
R# show bgp afi safi prefix/prefix-length                      >>>>>>>>> The BGP path attributes for an IPv6 route are displayed
R# show ipv6 route bgp                                         >>>>>>>>> shows the IPv6 BGP route entries

--------------------------------------------------------------------------------
--------------------------------------------------------------------------------

>> BGP ROUTE SUMMARIZATION
   -----------------------
   -----------------------
There are two techniques for BGP summarization:
   Static:
       - Create a static route to Null0 for the summary network prefix and then advertise the prefix               
           with a network statement. 
       - The downfall of this technique is that the summary route is always advertised, even if the 
           networks are not available.
                >>static routes using Null0 virtual interface:
                    R(config)# ip route 0.0.0.0 0.0.0.0 gi0/0 192.168.1.2
                    R(config)# ip route 172.16.3.0 255.255.255.0 gi0/2 172.16.1.2
                    R(config)# ip route 172.16.0.0 255.255.240.0 Null0

   Dynamic: 
       - Configure an aggregation network prefix. 
       - When viable component routes that match the aggregate network prefix enter the BGP table, 
           then the aggregate prefix is created. 
       - The originating router sets the next hop to Null0 as a discard route for the aggregated prefix 
           for loop prevention.

--------------------------------------------------------------------------------

>> Aggregate Address:
  ------------------

>> Dynamic route summarization is accomplished with the BGP address family configuration
R(config-router)# aggregate-address network subnet-mask [summary-only] [as-set] 
R(config-router-af)# aggregate-address network subnet-mask [summary-only] [as-set] 

R(config-router)# aggregate-address 172.16.0.0 255.255.240.0

-----------------------------------------------

R# show running-config | section router bgp
R# show bgp ipv4 unicast | begin Network
R# show ip route bgp | begin Gateway

-----------------------------------------------

- The aggregate-address command advertises the aggregated route in addition to the original component network prefixes. 
- Using the optional summary-only keyword suppresses the component network prefixes in the summarized network range.

R(config-router)# aggregate-address 172.16.0.0 255.255.240.0 summary-only

--------------------------------------------------------------------------------

>> Atomic Aggregate
   ----------------  
- Aggregated routes act like new BGP routes with a shorter prefix length. 
- When a BGP router summarizes a route, it does not advertise the AS_Path information from before the aggregation.
- BGP path attributes like AS_Path, MED, and BGP communities are not included in the new BGP advertisement.
- The atomic aggregate attribute indicates that a loss of path information has occurred.

R# show running-config | section router bgp
R# show bgp ipv4 unicast | begin Network
R# show bgp ipv4 unicast 172.16.0.0           >>>>> atomic aggregation set to indicate a loss of path attributes


--------------------------------------------------------------------------------

>> route Aggregation with AS_SET
   -----------------------------
- To keep the BGP path information history, the optional as-set keyword may be used with the aggregate-address command.
- As the router generates the aggregate route, BGP attributes from the component aggregate routes are copied over to it. 
- The AS_Path settings from the original prefixes are stored in the AS_SET portion of the AS_Path. - The AS_SET, which is displayed within brackets, only counts as one hop, even if multiple ASs are listed.

R(config-router-af)# aggregate-address network subnet-mask [summary-only] [as-set]  
R(config-router)# aggregate-address 172.16.0.0 255.255.240.0 as-set summary-only    >>>>> to keep the BGP path history the optional as-set keyword may be used
                                                                                    >>>>> notice Rs maight discards routes if it detect its AS in the AS-Path to prevent the loops

R# show running-config | section router bgp
R# show bgp ipv4 unicast | begin Network
R# show bgp ipv4 unicast 172.16.0.0 

-----------------------------------------------
R2# show running-config | section router bgp
router bgp 65200
bgp log-neighbor-changes
no bgp default ipv4-unicast
neighbor 10.12.1.1 remote-as 65100
neighbor 10.23.1.3 remote-as 65300
!
address-family ipv4
aggregate-address 192.168.0.0 255.255.0.0 as-set summary-only
aggregate-address 172.16.0.0 255.255.240.0 asset summary-only
redistribute connected
neighbor 10.12.1.1 activate
neighbor 10.23.1.3 activate
exit-address-famil
-----------------------------------------------


IPv6
----
R(config-router-af)# aggregate-address prefic/prefix-lenght [summary-only] [as-set]     >>>>> Configuring IPv6 BGP Aggregation 
R# show bgp ipv6 unicast | begin Network                                                >>>>> Verifying IPv6 Route Aggregation

===========================================================================================================
>> Advanced BGP:
   ============
   ============

  1) BGP Multihoming
     ===============
     - Providing redundancy by provide a second circite "two BGP session"
     - Resiliency > using two different ISP for each circuit 
     - use outbound BGP route policies for transit routing issues 

===========================================================================================================

  2) Conditional Matching:
     ==================== 
      1. Access Control Lists ACL
         ------------------------
         ------------------------
        - ACL provide 
           1) Filtering packets 
           2) packet classification for feature "QoS" 
           3) Identifying networks within routing protocols 
             ------------------------
              R(config)# ip access-list standerd {acl-number | acl-name} 
              R(config-std-nacl)# [sequence] {permit | deny} source source-wildcard

              R(config)# ip access-list extended {acl-number | acl-name} 
              R(config-ext-nacl)# [sequence] {permit | deny} protocol source sourcewildcard destination destination-wildcard
             ------------------------
        - Extended IGP Network Selection  
          ------------------------------
           . source fields indentify the "network", destination fields identify the "smallest prefix length" allowed in the network range         					
              R(config-ext-nacl)# permit ip  any  any                          >>(Please Review)>>> permits all networks to reach all networks 
              R(config-ext-nacl)# permit ip  any  172.16.0.0  0.15.255.255     >>(Please Review)>>> permits all networks in the 172.16.0.0/12 range
              R(config-ext-nacl)# permit ip  any  172.16.0.0  0.0.255.255      >>(Please Review)>>> permits all networks in the 172.16.0.0/12 range
              R(config-ext-nacl)# permit ip  any  host  192.168.1.1            >>(Please Review)>>> permits only the 192.168.1.1/32 network 

        - Extended BGP Network Selection 
          ------------------------------
           . source fields match against the "network", destination fields match against the "network mask"
           . (host = wildcard mask 0.0.0.0)
              R(config-ext-nacl)# permit ip  10.0.0.0    0.0.0.0      255.255.0.0      0.0.0.0     >>>>> permits only the 10.0.0.0/16 network
              R(config-ext-nacl)# permit ip  10.0.0.0    0.0.255.0    255.255.255.0    0.0.0.0     >>>>> permits any 10.0.X.0 network with a /24 prefix length
              R(config-ext-nacl)# permit ip  172.16.0.0  0.0.255.255  255.255.255.0    0.0.0.255   >>>>> permits any 172.16.X.X network with a /24 to /32 prefix length
              R(config-ext-nacl)# permit ip  172.16.0.0  0.0.255.255  255.255.255.128  0.0.0.127   >>>>> permits any 172.16.X.X network with a /25 to /32 prefix length         
              R(config-ext-nacl)# permit ip  100.64.0.0  0.0.255.0    255.255.255.128  0.0.0.0     >>>>> allow network 100.64.X.0 pattern with a prefix length of /25  
              R(config-ext-nacl)# permit ip  100.64.0.0  0.0.255.0   host 255.255.255.128          >>>>> allow network 100.64.X.0 pattern with a prefix length of /25 

      2. Prefix Matching "Prefix Lists"
         ------------------------------
         ------------------------------
           - Identifies multiple networks with a variety of prefix lengths
           - High order bit pattern "address or network"
           - High order bit count "length or mask lenght"
           - matching length parameters:
              le >> less than or equal
              ge >> greater than or equal 
           -----------------------------------
               R(config)# ip prefix-list prefix-list-name [seq sequencenumber] {permit | deny} high-order-bit-pattern/high-orderbit-count [ge ge-value] [le le-value]
               R(config)# ip prefix-list ABC seq 5 permit 192.168.0.0/16 ge 30 le 32
           -----------------------------------
           - Prefix lists process in sequential order in a top-down fashion, and the first prefix match processes
           - If a sequence is not provided, the sequence number autoincrements by 5, based on the highest sequence number. 
           - The first entry is 5
           - Sequencing enables the deletion of a specific entry. 
           - Because prefix lists cannot be resequenced, it is advisable to leave enough space for insertion of sequence numbers at a later time.
           - IOS and IOS XE require that the ge-value be greater than the high-order bit count and that the le-value be greater than or equal to the ge-value:
                (( high-order bit count < ge-value <= le-value ))

      3. Prefix Matching "IPv6 Prefix Lists"
         ----------------------------------
         ----------------------------------
           - The prefix matching logic works exactly the same for IPv6 networks as for IPv4 networks. 
           - The most important thing to remember is that IPv6 networks are notated in hex and not in binary when identifying ranges. 
           - Ultimately, however, everything functions at the binary level.
           -----------------------------------
                R(config)# ipv6 prefix-list prefix-list-name [seq sequence-number] {permit | deny} high-order-bit-pattern/high-orderbit-count [ge ge-value] [le le-value]
                R(config)# ipv6 prefix-list PREFIX-IPv6 seq 5 permit 2001:2::/48 le 128 
           -----------------------------------

      4. Regular Expressions (regex)
         ---------------------------
         ---------------------------
           - In BGP, we can use Regex to match AS numbers in the AS-Path attribute.
           - Regular expressions (regex) are used to parse through the large number of available ASNs (4,294,967,295)
           - Regular expressions are based on query modifiers used to select the appropriate content. 
           -----------------------------------       
                R# show bgp afi safi regexp regex-pattern    >>>>> The BGP table can be parsed with regex by using the command 
           -----------------------------------
           - Learning regex can take time, but the most common ones used in BGP involve the ^, $, and _
              >> ^$                              >>>>> local originating routes
              >> permit ^200_                    >>>>> only routes from neighbor AS 200
              >> permit _200$                    >>>>> only routes originating from AS 200 
              >> permit _200_                    >>>>> only routes that pass through AS 200
              >> permit ^[0-9]+ [0-9]+ [0-9]+?   >>>>> routes with three or fewer AS_Path entries

           - Modifiers:         >>>>> applied to the ((AS_Path))
             ---------
              _   (underscore)          >>>>> Matches a space
              ^   (caret)               >>>>> Indicates the start of a string
              $   (dollar sign)         >>>>> Indicates the end of a string
              []  (brackets)            >>>>> Matches a single character or nesting within a range
              -   (hyphen)              >>>>> Indicates a range of numbers in brackets
              [^] (caret in brackets)   >>>>> Excludes the characters listed in brackets
              ()  (parentheses)         >>>>> Used for nesting of search patterns
              |   (pipe)                >>>>> Provides OR functionality to the query
              .   (period)              >>>>> Matches a single character, including a space
              *   (asterisk)            >>>>> Matches zero or more characters or patterns
              +   (plus sign)           >>>>> Matches one or more instances of the character or pattern
              ?   (question mark)       >>>>> Matches one or no instances of the character or pattern

===========================================================================================================

  3) Route Map:
     ========= 
      - A route map uses the command syntax 

        R(config)# route-map "route-mapname" [permit | deny] [sequence-number]
       -------------
      Ex:
        R(config)# route-map Example permit 10   
        R(config-route-map)# match ip address ACL-ONE
        R(config-route-map)# set metric 20

        R(config)# route-map Example permit 40          >>>>> matching criteria not specified, all prefixes are permitted,  
                                                              if sequence was not configured all prefixes would drop (because of the implicit deny for all route-maps) 

  ---------------------------------------------------------------

      - Conditional matching options:
        ----------------------------
        ----------------------------
        R(config-route-map)# match as-path "acl number"                                          >>>>> selects prefixes based on a regex query to isolate the ASN in the BGP path attribute (PA) AS path
        R(config-route-map)# match ip address {acl-number | acl-name}                            >>>>> selects prefixes based on network selection criteria defined in the ACL
        R(config-route-map)# match ip address prefix-list "prefix-list-name"                     >>>>> selects prefixes based on prefix selection criteria
        R(config-route-map)# match local-preference "local-preference"                           >>>>> selects prefixes based on the BGP attribute local preference
        R(config-route-map)# match metric {1-4294967295 | external 1-4294967295} [+- deviation]  >>>>> selects prefixes based on a metric that can be exact, a range, or within acceptable deviation
        R(config-route-map)# match tag "tag-value"                                               >>>>> selects prefixes based on a numeric tag (0 to 4294967295) that was set by another router

        1- Multiple Conditional Match Conditions:
           --------------------------------------
           . If there are multiple variables (ACLs, prefix lists, tags, and so on) configured for a specific route map sequence, only one
             variable must match for the prefix to qualify. 
          -------------
           R(config)# route-map EXAMPLE permit 10
           R(config-route-map)# match ip address ACL-ONE ACL-TWO

           R(config)# route-map EXAMPLE deny 20
          -------------
           . If there are multiple match options configured for a specific route map sequence, both match options must be met for the
             prefix to qualify for that sequence. 
          -------------
           R(config)# route-map EXAMPLE permit 10
           R(config-route-map)# match ip address ACL-ONE
           R(config-route-map)# match metric 550 +- 50
          -------------

        2- Complex Matching
           ----------------
           . Some network engineers find route maps too complex if the conditional matching criteria use an ACL, an AS path ACL, or a prefix list that contains a deny statement. 
           . Route maps process using a particular order of evaluation:
             the sequence, conditional match criteria, processing action, and optional action in that order.
           . Any deny statements in the match component are isolated from the route map sequence action.

  ---------------------------------------------------------------

      - Optional Actions:
        ----------------
        ----------------
        . In addition to permitting the prefix to pass, route maps can modify route attributes.

           R(config-route-map)# set as-path prepend {"asnumber-pattern" | last-as "1-10"} >>>>> Prepends the AS path for the network prefix with the pattern specified or from multiple iterations from a neighboring AS.
           R(config-route-map)# set ip next-hop {"ip-address" | peeraddress | self }      >>>>> Sets the next-hop IP address for any matching prefix. BGP dynamic manipulation uses the peer-address or self keywords.
           R(config-route-map)# set localpreference "0-4294967295"                        >>>>> Sets the BGP PA local preference.
           R(config-route-map)# set metric {+value | -value | value}                      >>>>> (where value parameters are 0–4294967295) Modifies the existing metric or sets the metric for a route.
           R(config-route-map)# set origin {igp | incomplete}                             >>>>> Sets the BGP PA origin.
           R(config-route-map)# set tag "tag-value"                                       >>>>> Sets a numeric tag (0–4294967295) for identification of networks by other routers
           R(config-route-map)# set weight "0–65535"                                      >>>>> Sets the BGP PA weight.

  ---------------------------------------------------------------

      - The continue Keyword:
        --------------------
        --------------------
         - Default route map behavior processes the route map sequences in order, and upon the first match, it executes the processing
           action, performs any optional action (if feasible), and stops processing. 
         - This prevents multiple route map sequences from processing.
         - Adding the keyword continue to a route map allows the route map to continue processing other route map sequences.

       ---------------
      Ex:
           ip access-list standard ACL-ONE
            permit 192.168.1.1 0.0.0.0
            permit 172.16.0.0 0.0.255.255
           !
           ip access-list standard ACL-TWO
            permit 192.168.1.1 0.0.0.0
            permit 172.31.0.0 0.0.255.255
           !
           R(config)# route-map EXAMPLE permit 10
           R(config-route-map)# match ip address ACL-ONE
           R(config-route-map)# set metric 20
          *R(config-route-map)# continue
           !
           route-map EXAMPLE permit 20
            match ip address ACL-TWO
            set ip next-hop 10.12.1.1
           !
           route-map EXAMPLE permit 30
            set ip next-hop 10.13.1.3
       ---------------


===========================================================================================================

  4) BGP ROUTE FILTERING AND MANIPULATION: (route policy)
     ====================================
     - filtering routes inbound or outbound for a specific BGP peer.

   ---------------------------------------------------------------
      1- Distribute List Filtering:
         -------------------------
         R(config-router-af)# neighbor "ip-address" distribute-list {"acl-number" | "acl-name"} {in | out}
       -------------
       Ex:
        ip access-list extended ACL-ALLOW
         permit ip 192.168.0.0 0.0.255.255 host 255.255.255.255   >>>>> allow any network 192.168.0.0 to 192.168.255.255 range with a prefix length of /32 (host = wildcard mask 0.0.0.0)
         permit ip 100.64.0.0  0.0.255.0   host 255.255.255.128   >>>>> allow network 100.64.X.0 pattern with a prefix length of /25
        !
        R(config)# router bgp 65100
         address-family ipv4
          neighbor 10.12.1.2 distribute-list ACL-ALLOW in
       -------------

   ---------------------------------------------------------------
      2- Prefix List Filtering:
         ---------------------
         R(config-router-af)# neighbor "ip-address" prefix-list "prefix-list-name" {in | out}
       -------------
       Ex:
        R1(config)# ip prefix-list RFC1918 seq 5 permit 192.168.0.0/16 ge 32
        R1(config)# ip prefix-list RFC1918 seq 10 deny 0.0.0.0/0 ge 32
        R1(config)# ip prefix-list RFC1918 seq 15 permit 10.0.0.0/8 le 32
        R1(config)# ip prefix-list RFC1918 seq 20 permit 172.16.0.0/12 le 32
        R1(config)# ip prefix-list RFC1918 seq 25 permit 192.168.0.0/16 le 32
        R1(config)# router bgp 65100
        R1(config-router)# address-family ipv4 unicast
        R1(config-router-af)# neighbor 10.12.1.2 prefixlist RFC1918 in
       -------------

   ---------------------------------------------------------------
      3- AS Path ACL Filtering:
         ---------------------
         - If this were an Internet connection and R were an enterprise, it would not want to advertise routes learned from other ASs. 
         - Using an AS path access list to restrict the advertisement of only its AS is recommended.

         - Processing is peformed in a sequential top-down order, and the first qualifying match processes against the appropriate permit or deny action. 
         - An implicit deny exists at the end of the AS path ACL. 

         - IOS supports up to 500 AS path ACLs and uses the command 
          -------------------
           (config)# ip as-path access-list "acl-number" {deny | permit} "regex-query"     >>>>> for creating an AS path ACL. 
          -------------------

         - The ACL is then applied with the command
          ------------------- 
           (config-router-af)# neighbor "ip-address" filterlist "acl-number" {in | out}
          -------------------

          -------------------
         Ex:
          (config)# ip as-path access-list 1 permit ^$
          
          (config)# router bgp 65200
          (config-router)# address-family ipv4 unicast
          (config-router-af)# neighbor 10.12.1.1 filter-list 1 out
          (config-router-af)# neighbor 10.23.1.3 filter-list 1 out
          -------------------

   ---------------------------------------------------------------
      4- Route Maps:
         ----------
         - As explained earlier, route maps provide additional functionality over pure filtering. 
         - Route maps provide a method to manipulate BGP path attributes as well. 
         - Route maps are applied on a BGP neighbor basis for routes that are advertised or received. 
         - A different route map can be used for each direction. 
         - The route map is associated with the BGP neighbor under the specific address family with the command 
          ------------------- 
          (config-router-af)# neighbor "ip-address" route-map "routemap-name" {in | out} 
          -------------------

        -------------------
         Ex:
          ip prefix-list FIRST-RFC1918 permit
          192.168.0.0/15 ge 16
          ip as-path access-list 1 permit _65200$
          ip prefix-list SECOND-CGNAT permit 100.64.0.0/10 ge 11
          !
          route-map AS65200IN deny 10
           description Deny any RFC1918 networks via Prefix List Matching
           match ip address prefix-list FIRST-RFC1918
          !
          route-map AS65200IN permit 20
           description Change local preference for AS65200 originate route in 100.64.x.x/10
           match ip address prefix-list SECOND-CGNAT
           match as-path 1
           set local-preference 222
          !
          route-map AS65200IN permit 30
           description Change the weight for AS65200 originate routes
           match as-path 1
           set weight 65200
          !
          route-map AS65200IN permit 40
           description Permit all other routes un-modified
          !
          router bgp 65100
           address-family ipv4 unicast
            neighbor 10.12.1.1 route-map AS65200IN in
        -------------------


   ---------------------------------------------------------------
      5- Clearing BGP Connections:
         ------------------------
         - Depending on the change to the BGP route manipulation technique, a BGP session may need to be (((refreshed)))) in order to take effect. 

         - BGP supports two methods of clearing a BGP session:
            1) The first method is a (((hard reset))), which tears down the BGP session, removes BGP routes from the peer, and is the most disruptive. 
            2) The second method is a (((soft reset))), which invalidates the BGP cache and requests a full advertisement from its BGP peer.

               . Routers initiate a hard reset with following command or a soft reset by using the optional soft keyword  
                 -------------------
                  # clear ip bgp "ip-address" [soft]     >>>>> peer IP-add of the connection specified
                 -------------------
               . All of a router’s BGP sessions can be cleared by using an asterisk * in lieu of the peer’s IP address
                 -------------------
                  # clear ip bgp * [soft] 
                 -------------------
               . Soft resets can be performed for a specific address family with the command
                 -------------------
                  # clear bgp "afi" "safi" {"ip-address" | *} soft [in | out]
                 -------------------


===========================================================================================================
===========================================================================================================
===========================================================================================================


>> IPv4 Access Control Lists ACL:
   =============================
   =============================
  - ACL provide 
           1) Filtering packets 
           2) packet classification for feature "QoS" 
           3) Identifying networks within routing protocols 

  - IOS refer to each line in an ACL as an (Access Control Entry "ACE", or ACL Statements)
  - main steps for design:
     . 1) Action
             deny   >> discard packets
             permit >> Allow packet to keep going 
     . 2) Location 
             "Interface"
     . 3) Direction 
              Outbound 
              Inbound 
  - ACLs use first match logic 
  - If a packet does not match any of the items in the ACL, the packet is dicarded 
     . Every IP ACL has "deny all" statement implied at the end of the ACL
  - A maximum of one ACL can be applied to a single interface per direction 

  - Types of ACLs:
     . standerd numbered ACLs (1-99, 1300-1999)
     . Extended numbered ACLs (100-199, 2000-2699)
     . Standerd named ACLs
     . Extended named ACLs
     . Improved editing with sequence numbers 
  - Filter based on (SIP add, DIP add, TCP/UDP, port#, Other headers)
  - any keyword >> replace 0.0.0.0 0.0.0.0 (network/mask)
  - host keywork refer to /32

--------------------------
  - Ping (Echo reply):
    -----------------
     . successful
     . destination host unreachable >>>>> no path available in the gateway "router" routing table
                                    >>>>> ACL deny the packet
     . request time out             >>>>> path available in the gateway "router" routing table but no responce being returned"
===========================================================================================================

   1) Standard Numbered IPv4 ACLs:                     
      ===========================
      - ACL location should be near to the destination
      - matching parameters matches only the source IP address of the packet.
      - Replace Implicit with Explicit deny any to see the counters of matched packets 
      - permit any override the default deny any statement
      - Router does not filter packets that the router itself creates with an outbound ACL
        (routing protocol messages, ping packets, traceroute packets) 
       -------------------
         R(config)# access-list {1-99 | 1300-1999} {permit | deny}  {S_IP, | S_Network IP + WCM}  >>>>> define action and matching parameters 
                                                                        
         R(config)# int s0/0/1                                                                    >>>>> (enable ACL location & direction)
         R(config-if)# ip access-group # {in | out} 
       -------------------
             Examples:
              R(config)# access-list 1 permit 10.1.1.1
              R(config)# access-list 1 permit host 10.1.1.1                                       >>>>> (host keyword is optional)   
              R(config)# access-list 1 permit 10.0.0.0 0.255.255.255
              R(config)# access-list 1 permit any
              R(config)# access-list 1 deny any    
---------------------------
             Show:
              R# show running-config                                              >>>>> show access control entries (ACE) or ACL statements & remark "Description" 
              R# show access-lists                                                >>>>> show the matches for the packets 
              R# show ip access-lists                                             >>>>> show the matches for the packets    
              R# sh ip interface s0/0/1                                           >>>>> in & out ACL statuse 

---------------------------

     - Text description
       ----------------
         R(config)# access-list 1  remark  permit packets coming from host A          >>>>> "description" show from show run

     - Disable an ACL:
       -------------- 
           from its interface (using the no ip access-group interface subcommand)

===========================================================================================================


   2) Extended Numbered IP Access Control Lists:        
      =========================================
      - ACL location should be close as possible to the source (save some bandwidth)
      - larger varity of packet header fields can be used to match a packet "more complex & more useful"
      - Matching parameters:
         . IP protocol type (Identifies next header "L4") ( keyword --> "TCP, UDP, ICMP, EIGRP, IP" )   >>>>> (IP: means all ipv4 packet types)
         . S-IP address if host & (if network = S-IP + WCM)
         . D-IP address if host & (if network = D-IP + WCM)
          (host keyword is required with spacific ip address)
         . S-port and/or D-port with TCP/UDP protocol type 
      -  All the matching parameters must match the packet for the packet to match the command 
     
         -----------------------                                                     
            R(config)# access-list {100-199 | 2000-2699} {permit | deny} {IP | TCP | UDP | ICMP | EIGRP} {host S_IP | "Network-IP + WCM"} {host D_IP | "Network-IP + WCM"} 
                                                                                   protocol
            R(config)# int s0/0/1                                                                    >>>>> (enable ACL location & direction)
            R(config-if)# ip access-group # {in | out} 
         -----------------------
             Examples:
              R(config)# access-list 101 deny tcp any any 
              R(config)# access-list 101 deny ip host 1.1.1.1 host 2.2.2.2
              R(config)# access-list 101 deny udp 1.1.1.0 0.0.0.255 any 
              R(config)# access-list 101 permit ip any any 
         -----------------------

          
      -  Matching TCP and UDP port numbers:  80=www
         . When using TCP/UDP command can optionally reference the source (and/or) destination port number
           . well-known ports (0 - 1023)
           . user defined ports (1024 - 65535)
              > decimal port number (80)
              > keyword port number (www)
         -----------------------
              R(config)# access-list {100-199 | 2000-2699} {permit | deny} {TCP | UDP} {host S_IP | "Network-IP + WCM"} {eq | ne | lt | gt | range} S_Port {host D_IP | "Network-IP + WCM"} {eq | ne | lt | gt | range}  D_Port
                                                                           protocol                               
              R(config)# int s0/0/1                                                                    >>>>> (enable ACL location & direction)
              R(config-if)# ip access-group # {in | out} 
         -----------------------
             Examples:
              R(config)# access-list 101 deny tcp any gt 49151 host 10.1.1.1 eq 23
              R(config)# access-list 101 deny tcp any host 10.1.1.1 eq 23
              R(config)# access-list 101 deny tcp any host 10.1.1.1 eq telnet
              R(config)# access-list 101 deny udp 1.0.0.0 0.255.255.255 lt 1023 any 

       ---------------------------
             Show:
              R# show running-config                                              >>>>> show access control entries (ACE) or ACL statements & remark "Description" 
              R# show access-lists                                                >>>>> show the matches for the packets 
              R# show ip access-lists                                             >>>>> show the matches for the packets    
              R# sh ip interface s0/0/1                                           >>>>> in & out ACL statuse 
       ---------------------------
     - Text description
       ----------------
         R(config)# access-list 101  remark  permit packets coming from host A          >>>>> "description" show from show run

     - Disable an ACL:
       -------------- 
           from its interface (using the no ip access-group interface subcommand)

===========================================================================================================

      Named ACLs:
      ==========
      - Advantages over numbered ACL:
         1. Using names "easier to remember the reason for the ACL"
         2. Editing "add/insert, delete" individual statements
         3. Use ACL subcommands not global commands to define action and matching parameters


===========================================================================================================

***********************************************************************************************************
***********************************************************************************************************
***********************************************************************************************************

      Editing ACLs using sequence Numbers:
      ===================================
      - The ability to edit a numberd IP ACL was poor 
         . to simply delete a line from the ACL, the user had to delete the entire ACL and then reconfigure it
      - ACL sequence numbers provide the following features for both numberd and named ACLs
         . Deleting single lines
         . Inserting new lines 
         . use the new configuration style with numbered ACL to allow this feature (if inserted new statement with the old style it will work and be added as last line)  
      - sequence numbers starts with 10 and increase by 10 for each new statement "leting a space of lines to enable editing"

      - ACL provide:
        ----------- 
         1) Filtering packets 
         2) packet classification for feature "QoS" 
         3) Identifying networks within routing protocols 

      - Standared ACLs: define packets based solely on the source network
      - Extended ACL: define packets based on source, distination, protocol, port, or a combination of other packet attributes

         -----------------------
         R(config)# ip access-list standerd {acl-number | acl-name} 
         R(config-ACL)# [sequence] {permit | deny} source source-wildcard
 
         R(config)# ip access-list extended {acl-number | acl-name} 
         R(config-nacl)# [sequence] {permit | deny} protocol source sourcewildcard destination destination-wildcard
         -----------------------

             Show:
              R# show running-config                                              >>>>> show access control entries (ACE) or ACL statements & remark "Description" 
              R# show access-lists                                                >>>>> show the matches for the packets 
              R# show ip access-lists                                             >>>>> show the matches for the packets    
              R# sh ip interface s0/0/1                                           >>>>> in & out ACL statuse 
         -----------------------

      - Deleting lines in ACL (add no keyword at the begining of the statement or the sequence number)
         -----------------------
          R(config)# ip access-list extended Mohab    
          R(config-ext-nacl)# no deny ip 10.1.2.0 0.0.0.255 10.2.3.0 0.0.0.255     
           -------
          R(config)# ip access-list standerd 24
          R(config-std-nacl)# no 20
         -----------------------

      - inserting lines in ACL
         -----------------------
          R(config)# ip access-list standerd 24
          R(config-std-nacl)# 5 deny 10.1.1.1
         -----------------------

         -----------------------
      - ACL Implementation considerations and recommendations 
         . Standard ACL location should be near to the destination (match only S-IP)
         . Extended ACL location should be close as possible to the source (save some bandwidth)
         . Place more specific statements early in the ACL
         . Disable an ACL from it's interface using no ip access-group
         -----------------------


***********************************************************************************************************
***********************************************************************************************************
***********************************************************************************************************

===========================================================================================================

   3) Standard Named IPv4 ACLs: "same spects axactly like standered numbered" 
      ========================
      - ACL location should be near to the destination
      - matches only the source IP address of the packet

       ---------------------------
          R(config)# ip access-list standerd "acl-name"   
          R(config-std-nacl)# {permit | deny} {S_IP | network IP + WCM}       >>>>> define action and matching parameters
                                   
          R(config)# int s0/0/1                                          >>>>> (enable ACL location & direction)
          R(config-if)# ip access-group "acl-name" {in | out} 
       ---------------------------

       ---------------------------
             Show:
              R# show running-config                                              >>>>> show access control entries (ACE) or ACL statements & remark "Description" 
              R# show access-lists                                                >>>>> show the matches for the packets 
              R# show ip access-lists                                             >>>>> show the matches for the packets    
              R# sh ip interface s0/0/1                                           >>>>> in & out ACL statuse 
       ---------------------------
===========================================================================================================


   4) Extended Named IP Access Control Lists:   "same spects axactly like extended numbered"     
      =======================================
      - ACL location should be close as possible to the source (save some bandwidth)


       ---------------------------  
          R(config)# ip access-list extended "acl-name"                                                   
          R(config-ext-nacl)# {permit | deny} {IP | TCP | UDP | ICMP | EIGRP} {host S_IP | "Network-IP + WCM"} {host D_IP | "Network-IP + WCM"} 
                                                      protocol
          R(config)# int s0/0/1                                                                    >>>>> (enable ACL location & direction)
          R(config-if)# ip access-group # {in | out} 
       ---------------------------

      - Matching TCP and UDP port numbers:
       ---------------------------
          R(config)# ip access-list extended "acl-name"   
          R(config-ext-nacl)# {permit | deny}   {TCP | UDP}   {host S_IP | "Network-IP + WCM"} {eq | ne | lt | gt | range} S_Port {host D_IP | "Network-IP + WCM"} {eq | ne | lt | gt | range}  D_Port
                                                 protocol                 
                         
          R(config)# int s0/0/1                                                                    >>>>> (enable ACL location & direction)
          R(config-if)# ip access-group "acl-name" {in | out} 
       ---------------------------

       ---------------------------
             Show:
              R# show running-config                                              >>>>> show access control entries (ACE) or ACL statements & remark "Description" 
              R# show access-lists                                                >>>>> show the matches for the packets 
              R# show ip access-lists                                             >>>>> show the matches for the packets    
              R# sh ip interface s0/0/1                                           >>>>> in & out ACL statuse 
       ---------------------------

===========================================================================================================


>> Port Security:
   =============
   - If you know what devices should be cabled to an interface on a switch "ristrict that interface so that only expected devices can use it"
   - port security identifies devices based on the "S-MAC address"
   - Options:
      . switch enable port security "Per Port"
      . Each port has maximum number of allowed MAC address
         "any extra mac after the allowed max will be counted as violation and switch by default will discard the traffic"
   - Setting the maximum number of MAC address
      1. Static
      2. Dynamic (first 8 MAC-add learned through the port using feature called sticky secure MAC-addresses)
      3. Mix
   - switches can also use port security on voice ports and etherchannels
       . for voice ports, make sure to config the max mac-add to (at least two) "one for the phone and one for the PC connected to the phone"
       . on etherchannel the port security configuration should be placed on the (port-channel interface) no the physical individual interfaces 
   - If port-security feature is enabled on an interface the mac addresses will be recorded in the mac-add table as static entries 

   - a violation occurs when:
      1. mac-adds exeeds the configured max
      2. s-mac in not one of the configured adds
   - violation modes
       1) shutdown "defualt"
          . discards offending traffic
          . sends log and SNMP messages 
          . Increments the violation counter for each violating incoming frame
          . Disables the interface by putting it in err-disabled state, discarding all traffic
       2) restrict
          . discards offending traffic
          . sends log and SNMP messages 
          . Increments the violation counter for each violating incoming frame
       3) protect
          . discards offending traffic

---------------------------------------------------------------------------------------------------------------------------------------

       ---------------------------
          S(config)# int g0/0
          S(config-if)# switchport mode {access | trunk}                                     >>>>> trunk mode should be set statically not by DTP to allow port security
          S(config-if)# switchport port-security                                             >>>>> enable port security on the interface 
                                                                                             >>>>> now port will dynamically learn one mac "the firest mac reach or connect to the interface"  
                                                                                                   (max # of allowed MAC adds by default=1)
      (optional)
         S(config-if)# switchport port-security violation {restrect | protect | shutdown}    >>>>> default shutdown
1)       S(config-if)# switchport port-security maximum #                                    >>>>> max # of allowed MAC adds by default=1
2)       S(config-if)# switchport port-security mac-address "xxxx"                           >>>>> learn macs statically "add mac-add manually"
3)       S(config-if)# switchport port-security mac-address sticky                           >>>>> learn macs dynamically from the frames reaches the port
       ---------------------------


       ---------------------------
       Example:
        Static:
          S(config)# int g0/0
          S(config-if)# switchport mode access                                  
          S(config-if)# switchport port-security 
          S(config-if)# switchport port-security mac-address  0200.1111.1111
        Sticky:                                                                   >>>>> port security does not save the configuration of the sticky addresses if desired use "copy run start"
          S(config)# int g0/1
          S(config-if)# switchport mode access                                 
          S(config-if)# switchport port-security
          S(config-if)# switchport port-security mac-address sticky 
        Dynamic:
          S(config)# int g0/2
          S(config-if)# switchport mode access                                   
          S(config-if)# switchport port-security
        Dynamic:
          S(config)# int g0/3
          S(config-if)# switchport mode trunk                                  
          S(config-if)# switchport port-security
          S(config-if)# switchport port-security maximum 8
       ---------------------------
     Show:
     ----
       sw# show run int f0/2                       >>>>> port-security config 
       sw# show port-security                      >>>>> interfaces with security actions
       sw# show port-security interface f0/1       >>>>> port-security status "Enabled", violation mode "shutdown" and status "secure-shutdown | secure-up", max max-add, last source address for the violation
       sw# show interfaces f0/2 status             >>>>> validating errdisabled state

   - If port-security feature is enabled on an interface the mac addresses will be recorded in the mac-add table as static entries    
       sw# show mac address-table secure int f0/1   (insted)   sw# sh mac address-table dynamic int f0/1
       ---------------------------

   - to recover from err-disable state:
       1) shutdown -> no shutdown
       2) config Automatic Recovery: 
          S(config)# errdisable  recovery  cause  psecure-violation
          S(config)# errdisable  recovery  interval "sec"

              # show errdisable recovery                          >>>>> check enabled errdisable reason
       ---------------------------

===========================================================================================================

>> Dynamic Host Configuration Protocol (DHCP):
   ==========================================
   - User devices in TCP/IP network learn their IPv4 "host ip configuration" settings using DHCP
   - DHCP allows 
      . Permanent assignment of host addresses
      . Temporary lease of IP addresses 
   - DHCP enables mobility
   - DHCP works automatically for user hosts 

   - Host computer "DHCP Client" needs:
      . IPv4 address
      . Mask
      . Default router 
      . DNS server IP address
      . TFTP "used by cisco ip phones"

   - DHCP server on the same LAN:
     ---------------------------
   - DHCP uses the following messages between the client and server: (DHCP DORA Messages) 
      . Discover"DHCP broadcast flag" contain Client-ID "MAC-Add"
      . Offer "client use the first received offer"
      . Request
      . Acknowledge
   - DHCP Server recieve on (port 67), DHCP Client recieve on (port 68)     
   - Client S-IP: 0.0.0.0 & D-IP: 255.255.255.255
      . DHCP Discover Message – Broadcast
      . DHCP Offer Message – Broadcast in the network layer and unicast in the data link layer
      . DHCP Request Message – Broadcast in the network layer and unicast in the data link layer
      . DHCP Acknowledge Message – Broadcast in the network layer and unicast in the data link layer

   - DHCP server on a remote subnet:
     ------------------------------
      . Use Feature "DHCP relay agent" (Centralized DHCP server)

   - DHCP allocation mode:
      . Dynamic
      . Automatic "sets the DHCP lease to infinite" "add remain with that client indefinitely"
      . Static "preconfigures the specific ip add for a client based on the client MAC-add" "that specific client is the only client that then uses the ip add"
------------------------------------------------------------------------------------------------------------


   > DHCP Relay agent:
     ================
     - Turn the BC Descover message into unicast Descover message (S-IP: 0.0.0.0 , D-IP: 255.255.255.255) >> (S-IP: R local int , D-IP: DHCP server)

       R(config)# int g0/0                                 >>>>> local/LAN interface 
       R(config-if)# ip helper-address "DHCP server-ip"    >>>>> (R = Relay agent)
     ----------------
         R# show ip interface g0/0              >>>>> check relay agent configuration 
         R# show run intreface g0/0 
         R# show ip helper-address

  --------------------------------

   > Configuring a SW as DHCP client:
     ===============================
    sw(config)# int vlan 1
    sw(config-if)# ip add dhcp
    sw(config-if)# no sh
  --------------------------------
      sw# show interfaces vlan 1        >>>>> check internet address released 
      sw# show dhcp lease               >>>>> check ip-add and GW released
      sw# show ip default-gateway
  --------------------------------
   > Configuring a R as DHCP client:
     ==============================
     - router turn the default gateway lerned from DHCP into default route S* with AD=254 
    sw(config)# int g0/0
    sw(config-if)# ip add dhcp
    sw(config-if)# no sh


  --------------------------------
    > DHCP Pool on router:
      ===================
        R(config)# ip dhcp excluded-address 10.0.10.1
        R(config)# ip dhcp pool vlan 20                         >>>>> pool name | vlan "subnet pool"
        R(config-dhcp)# network 172.16.21.0 255.255.255.0       >>>>> pool "network range"
        R(config-dhcp)# default-router 172.16.21.2              >>>>> gateway IP
        R(config-dhcp)# dns-server 8.8.8.8 4.2.2.2 1.1.1.1      >>>>> DNS IP
      ---------------
          R# show run | sec dhcp


===========================================================================================================

>> DHCP Snooping:
   =============
    - DHCP snooping on a switch asts like a firewall or an ACL
    - It analyzes incoming messages on the specified subnet of ports in a VLAN 
    - Never filter non-DHCP messages 
    - Allow or discard the incoming DHCP messages 
    - Operates on L2 LAN SW and enabled on L2 ports 
    - Function on the switch between DHCP client & DHCP server 
    - Works on all ports in a VLAN, but with each port being Trusted or untrusted by DHCP snooping 

      1) DHCP messages received on an untrusted ports:
         1. Message sent by server   >>>>> "DHCP offer & ACK" will always be discarded
         2. Message sent by a client >>>>> maybe filtered if they appear to be part of an attack 

      2) DHCP messages received on a trusted port:
         . Will be forwarded 

    - DHCP Snooping prevent Attacks:
      -----------------------------
      1) Man-in-the-middle attack "Spurious DHCP Server"
      2) Attacker could attempt to overload the DHCP server and lease all the addresses in the subnet so that no other hosts could obtain a lease 
      3) Before the client has finished with its lease, an attacker could send DHCP release msg and immediately try to lease that address 
      4) DOS-denial of service attack "generate large volumes of DHCP messages to overload the DHCP snooping feature and the switch CPU it self"

    - DHCP server send Offer and ACK
    - DHCP client send Discover, Request, Decline "During DORA", Release "no longer wants the add"
    - DHCP Snooping Rules:
      -------------------
      1) Examin all incoming DHCP messages
      2) if sent by server "discard the msg"
      3) if sent by client:
         1. Discover or Request >>>>> check MAC-add consistency between "Ethernet frame & DHCP message/DHCP chaddr field"
         2. Release or Decline  >>>>> check incoming interface plus IP address versus DHCP snooping binding table
      4) unfiltered msgs result in a DHCP lease, build a new entry to the DHCP snooping binding table (MAC, IP, VLAN, interface)

---------------------------------------------------------------------------------

    - DHCP Snooping Configuration:
      ---------------------------
       s(config)# ip dhcp snooping                         >>>>> Enable DHCP snooping 
       s(config)# ip dhcp snooping vlan 11                 >>>>> list the vlans on which to use DHCP snooping 
       s(config)# no ip dhcp snooping information option   >>>>> to make DHCP snooping work on a switch that is not also a DHCP relay agent, disable the option 82 feature 
                                                                 (DHCP relay agents add new fields to DHCP request defined as option 82 DHCP header field)

       s(config)# interface g0/0
       s(config-if)# ip dhcp snooping trust                >>>>> default "all interfaces untrusted"
      ---------------------------
          s# show ip dhcp snooping 
          s# show ip dhcp snooping binding
---------------------------------------------------------------------------------

    - Limiting DHCP message rates optional feature:
      --------------------------------------------
       - prevent DOS attack "couse DHCP snooping to fail to examin every message, allowing other DHCP attacks to then work"
       - If the number of incoming DHCP messages exceeds that limit over a one second, DHCP snooping treats the event as an attack & move the port to an err-disabled state 
       - the feature can be enabled both on trused and untrusted interfaces 
       - DHCP snooping defaults not to use rate limits

    - Limiting DHCP message rates config:
      ----------------------------------
       s(config)# interface g0/0
       s(config-if)# ip dhcp snooping limit rate 10            >>>>> 10 packet per sec rate limit
      ---------------------------------- 
      Automatic Recovery:   
       s(config)# errdisable recovery cause dhcp-rate-limit
       s(config)# errdisable recovery interval 30

  # show errdisable recovery                          >>>>> check enabled errdisable reason
      ---------------------------------- 
          s# show ip dhcp snooping 
          s# show ip dhcp snooping binding


===========================================================================================================

>> Dynamic ARP Inspection (DAI):
   ============================

    - DIA feature on a switch examins incoming ARP messages on untrusted ports to filter those it believes to be part of an attack 
    - DIA feature copmares incoming ARP messages "IP & MAC" with two sources of data:
      1) DHCP snooping binding table (MAC, IP, VLAN, interface)
      2) Any configured ARP ACL
       >>>>> If the incoming ARP msg not matching the lables in the switch "discards the ARP msg"
    - Access ports connected to end-user are often untrasted by DHCP snooping & DAI
    - Ports to other SW, R, Server, should be trusted 
    - DIA can use DHCP snooping table to statically configure data "IP&MAC" via tool called ARP ACL
      >>>>> usefull for ports connected to devices that use Static-IP-Add (DIA looks for both DHCP-Snooping & ARP ACL)

    - Attack:
      1) Man-in-the-middle attack > attacker send BC ARP reply called "Gratuitous ARP"
         >>>>> Triggering hosts to add incorrect ARP entries to their ARP tables 
               (convince hosts to send packets to the attacker's device insted of the true destination)
      2) DoS attack > attacker generating a large number of ARP messages 

---------------------------------------------------------------------------------
    - DAI Configuration:
      ------------------
      - Choose whether to rely on DHCP snooping, ARP ACLs, or both
      - if using DHCP snooping configure it 
 
       s(config)# ip arp inspection vlan 11                >>>>> choose the VLANs on which to enable DAI
       s(config)# ip dhcp snooping                         >>>>> Enable DHCP snooping 
       s(config)# ip dhcp snooping vlan 11                 >>>>> list the vlans on which to use DHCP snooping 
       s(config)# no ip dhcp snooping information option   >>>>> to make DHCP snooping work on a switch that is not also a DHCP relay agent, disable the option 82 feature 
                                                                 (DHCP relay agents add new fields to DHCP request defined as option 82 DHCP header field)

       s(config)# interface g0/0
       s(config-if)# ip dhcp snooping trust                >>>>> default "all interfaces untrusted"
       s(config-if)# ip arp inspection trust               >>>>> default "all interfaces untrusted"
      ---------------------------
          s# show ip dhcp snooping
          s# show ip dhcp snooping binding 
          s# show ip arp inspection                       >>>>> (forwarded, dropd, DHCP drops, ACL drops) frames
          s# show ip arp inspection statistics 

---------------------------------------------------------------------------------

    - Limiting DAI message rates feature:
      ----------------------------------
       - prevent DOS attack
       - DAI defaults to use rate limits for all interfaces trusted and untrased 
       - DAI allows the config of a burst interval "a number of seconds" "X arp msgs over seconds"

    - Limiting DAI message rates config:
      ----------------------------------
       s(config)# interface g0/0
       s(config-if)# ip dhcp snooping limit rate 10                     >>>>> 10 packet per sec rate limit
       s(config-if)# ip arp inspection limit rate 10                    >>>>> 10 packet per sec rate limit

       s(config)# interface g0/1
       s(config-if)# ip arp inspection limit rate 10 burst interval 4   >>>>> 10 packet per 4-sec rate limit
      ---------------------------------- 
      Automatic Recovery:   
       s(config)# errdisable recovery cause arp-inspection
       s(config)# errdisable recovery interval 30

  # show errdisable recovery                          >>>>> check enabled errdisable reason
      ---------------------------------- 
          s# show ip arp inspection interfaces                          >>>>> interface, rate, burst interval

---------------------------------------------------------------------------------

    - Configuring optional DAI Message checkes:
      ----------------------------------------
       s(config)# ip arp inspection validate {dst-mac | ip | src-mac}
      ---------------------------------- 
          s# show ip arp inspection


===========================================================================================================

>> NAT (Network Address Translation):
   =================================
    - Allows hosts with private IP to communicate with Internet "global unique public IP-adds"

    1) Static NAT:
       ----------
       ----------
       - one-to-one mapping
         ( inside local "10.1.1.1" <to> inside global "200.1.1.1" )

        ------------------------
      Config:
          R(config)# interface g0/0                                  >>>>> local interface
          R(config-if)# ip nat inside 

          R(config)# interface g0/1                                  >>>>> global interface
          R(config-if)# ip nat outside 

          R(config)# ip nat inside source static 10.1.1.1 200.1.1.1
        ------------------------
        Show:
            R# show running-config
            R# show ip nat translations            >>>>> NAT-table "inside local, inside global records" 
            R# show ip nat statistics              >>>>> total active translations "local to global", hits "number of packets sent and translation occurs"

---------------------------------------------------------------------------------

    2) Dynamic NAT:
       -----------
       -----------
       - one-to-one mapping >> with NAT-pool of dynamic inside global IP-adds
         ( inside local "10.1.1.1" <to> inside global "200.1.1.1" )
       - The dynamic entry stays in the table as long as traffic flows occasionally
       - you can configure a timeout-value "how long R wait having not translated any packets with that address before removing the dynamic entry"
       - If packet arrives form imside host needs NAT entry but all pooled IP-add are in use "R discard the packet"

          R# clear ip nat translation    >>>>> manually clear the dynamic entries from the table "not public ip are reserved for a private ip"

        ------------------------
      Config:
          R(config)# interface g0/0                                                     >>>>> local interface
          R(config-if)# ip nat inside 

          R(config)# interface g0/1                                                     >>>>> global interface
          R(config-if)# ip nat outside 

          R(config)# access-list 1 permit 10.1.1.0 0.0.0.255                            >>>>> private ip range to be translated 

          R(config)# ip nat pool pool-name  first-add  last-add  netmask  network-mask 
          R(config)# ip nat pool Fred 200.1.1.1 200.1.1.5 netmask 255.255.255.0

          R(config)# ip nat inside source list 1 pool fred                              >>>>> enable nat feature                  
        ------------------------
        Show:
            R# show running-config
            R# show ip nat translations            >>>>> NAT-table "inside local, inside global records" 
            R# show ip nat statistics              >>>>> total active translations "local to global", misses "all pool range are used", allocated "number of used ip-add from the pool" 
                                                         ,Hits/Misses "number of packets sent and translation occurs/ or not for some reasion", public-ip pool
            R# clear ip nat translation            >>>>> manually clear the dynamic entries from the table "not public ip are reserved for a private ip"
            R# debug ip nat 

---------------------------------------------------------------------------------

    2) PAT (Port Address Translation): (Overloading NAT)
       ------------------------------
       - Many-to-one mapping (use on public-IP and segragate between local sessions by the port number)
       - port number field has 16-bits, NAT overloading can use more than 65000 port numbers

         1) uses a pool of inside global addresses: 
            --------------------------------------
              Config:
                  R(config)# interface g0/0                                                     >>>>> local interface
                  R(config-if)# ip nat inside 

                  R(config)# interface g0/1                                                     >>>>> global interface
                  R(config-if)# ip nat outside 

                  R(config)# access-list 1 permit 10.1.1.0 0.0.0.255                            >>>>> private ip range to be translated 

                  R(config)# ip nat pool pool-name  first-add  last-add  netmask  network-mask 
                  R(config)# ip nat pool Fred 200.1.1.1 200.1.1.5 netmask 255.255.255.0

                  R(config)# ip nat inside source list 1 pool fred overload                     >>>>> enable overload-nat feature or PAT                   
               ------------------------

         2) uses one inside global ip addresses: 
            -----------------------------------
              Config:
                  R(config)# interface g0/0                                                     >>>>> local interface
                  R(config-if)# ip nat inside 

                  R(config)# interface g0/1                                                     >>>>> global interface
                  R(config-if)# ip nat outside 

                  R(config)# access-list 1 permit 10.1.1.0 0.0.0.255                            >>>>> private ip range to be translated 

                  R(config)# ip nat inside source list 1 interface g0/1 overload                >>>>> enable overload-nat feature or PAT             
          ------------------------

     >> Show:
            R# show running-config
            R# show ip nat translations            >>>>> NAT-table "inside local/port number, inside global records" 
            R# show ip nat statistics              >>>>> total active translations "local to global", misses "all pool range are used", allocated "number of used ip-add from the pool" 
                                                         ,Hits/Misses "number of packets sent and translation occurs/ or not for some reasion", public-ip pool
            R# clear ip nat translation            >>>>> manually clear the dynamic entries from the table "not public ip are reserved for a private ip"
            R# debug ip nat


===========================================================================================================

>> System Message Logging (Syslog): Device Management protocols (Syslog, NTP, CDP, LLDP)
   ===============================
       - Cisco devices notify administrator with a system message when an event take place 
       - Syslog log events such interface status change, ospf neighbor status change, etc

       - Syslog msgs Enabling:
         --------------------
         --------------------
         1) Console connection
            . IOS by default shows log messages to console users
               (config)# logging console [level-name | level-number]     >>>>> enable Syslog msgs on console
                                                                               . optional level name/number to set the severity level to be sent and any more sever ones "lower numbers"  
            Ex:
               (config)# logging console 7
               (config)# logging console debug
        ----------------------------------------------
         2) Remote/Terminal "telnet&SSH" connection: (two steps)
               (config)# logging monitor [level-name | level-number]     >>>>> enable Syslog msgs on remote sessions
                                                                               . optional level name/number to set the severity level to be sent and any more sever ones "lower numbers" 
               # terminal monitor                                        >>>>> during the remote session this command enables receiving the Syslog msgs

            Ex:
               (config)# logging monitor 7
               (config)# logging monitor debug

---------------------------------------------------------------------------------

       - Storing Log Messages for later review:
         -------------------------------------
         -------------------------------------
         1) sotre on RAM
               (config)# logging buffered [level-name | level-number]    >>>>> enable storing syslog msgs on device RAM
                                                                               . optional level name/number to set the severity level to be stored and any more sever ones "lower numbers" 
               # show logging                                            >>>>> show stored syslog msgs on RAM, 
                                                                               , the severity level set on console/monitor "remote" & set to be stored on buffer "RAM" / Trap "server", 
                                                                               , IP-add of syslog server 
               # clear logging                                           >>>>> to clear the syslog msgs stored 

            Ex:
               (config)# logging buffered 4
        ---------------------------------------------
         2) sotre on Server
               (config)# logging host {IP-address | host-name}          >>>>> enable storing syslog msgs on a server by providing its IP-add or Name
                                                                              (to display the records use the server web-interface)
               (config)# logging trap {level-name | level-number}       >>>>> optional command to set level name/number to set the severity level to be stored and any more sever ones "lower numbers" 

            Ex:
               (config)# logging host 172.16.3.9
               (config)# logging trap warning 
   
---------------------------------------------------------------------------------

       - Log Message Format:
         ------------------
         ------------------
           Ex: *Dec 18 17:10:15.079: %LINEPORTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to down 

            . Timestamp                                                >> *Dec 18 17:10:15.079
            . Facility "which process on the device generated the msg" >> %LINEPORTO
            . Severity level                                           >> 5
            . Mnemonic "event"                                         >> UPDOWN
            . Description                                              >> Line protocol on Interface FastEthernet0/0, changed state to down
            
               (config)# no service timestamps                   >>>>> disable the timestamp from the log msg if desired 
               (config)# service sequence-numbers                >>>>> enable seq# to be added to the log msg if desired 
                 Ex: 000011: %SYS-5-CONFIG_I: Configured from console by console

---------------------------------------------------------------------------------

       - Log Message Severity Levels:
         ---------------------------
         ---------------------------
            . The lower the number the more severe the event
            . the eight severity levels breaks into four sections:
                1) Severe
                    . Emergency     0   "system unusable"
                    . Alert         1   "Immediate action required"
                2) Impactful
                    . Critical      2
                    . Error         3
                    . Warning       4
                3) Normal 
                    . Notification  5
                    . Information   6
                3) Debug
                    . Debug         7

---------------------------------------------------------------------------------

       - The Debug Command:
         -----------------
         -----------------
            . debug command gives a way to ask IOS to moitor a certain internal event, and it has a huge number of options like show command
               Ex:
                  # debug ip ospf hello
            . take care debug use the CPU and remain active untill be deactivated 
                  # no debug                  >>>>> deactivated debuging 
                  # show process cpu          >>>>> monitor cpu use and consumption 
                  # show processes cpu stored
                  # show proc cpu h
            . recomended to use logging buffer on syslog insted of debug to reduce router CPU load 


===========================================================================================================
===========================================================================================================
===========================================================================================================

>> Network Time Protocol (NTP): Device Management protocols (Syslog, NTP, CDP, LLDP)
   ===========================
   ===========================
   - NTP Job is to synchroniz clocks
   - Devices in same network learn and send time-stamps to each other with NTP messages

   - Setting the time and timezone:
     -----------------------------
     -----------------------------
      . NTP works best if you set the device clock before enabling the NTP-client & NTP-server
         1) set the time zone
         2) set the Daylight savings time (DST) "summer time"
         3) set the date & time 
        Config:
           R(config)# clock timezone EST -5
           R(config)# clock summer-time EDT recurring week#  week-day  month  time(H:M)   week#  week-day  month  time(H:M)  >>>>> set the DST region "EDT", 
                                                                                                                                   If recurring set when to start and to end DST
           R# clock set 20:52:49  21  october 2015
        Show:
           R# show clock

---------------------------------------------------------------------------------

   - NTP Configuration:
     -----------------
     -----------------
       - Set the Device NTP Mode: 
         1) NTP Server Mode  
           **1. Learn time from internal device hardware, use software to keep time during device power loss
             2. Learn time from external clock using mechanisms other than NTP

             . NTP server mode device get its time info from the previouslly set internal clock
               (Learn time from internal device hardware, use software to keep time during device power loss)
 
              (config)# ntp master {stratum level}          >>>>> stratum = priority "level of relaiability or accurcy", 
                                                                  if there is a multiple servers the one with the lowest stratum will be the NTP refrence for the devices
                                                            >>>>> the lower the stratum level the more accurate the reference clock is considered to be 
                                                            >>>>> NTP server that use internal hardware or external reference clock set its own stratum level
                                                            >>>>> stratum level increase the more hops away from the original clock source
                                                            >>>>> stratum level command allows you to set a value from (1--15)
                                                            >>>>> default stratum level is 8 for internal reference 
                                                            >>>>> 15 is the highest useful stratum level, if 16 NTP consider the time/date unusable and not trust the time 
             Ex:
              (config)# ntp master 3
            ------------------------------
         2) NTP client/server Mode  
            . Device can act as client and when learning process is over stratum level increas by one and it act as a server now 

              (config)# ntp server {IP-address | Host-name} >>>>> set the server that the client will adjust the clock acording to 
             Ex:
              (config)# ntp server 172.16.3.3
          ------------------------------

      Show:
          R# show ntp status              >>>>> synchronization status, stratum level, reference server IP-add, learned time
          R# show ntp associations        >>>>> list of all available NTP servers IP-addresses to synch with 
                                                "address = my reference"             >>> if address = 127.127.1.1 it means the clock if set localy as I'm the master
                                                "ref clock = my reference reference"

---------------------------------------------------------------------------------

   - Redundant NTP Configuration:
     ---------------------------
     ---------------------------
     . NTP Server Mode  
        1. Learn time from internal device hardware, use software to keep time during device power loss
      **2. Learn time from external clock using mechanisms other than NTP

     . For good design at least refer to two external NTP server for redundancy
     . Instead of using a networking device as the reference clock use NTP server that has better clocking hardware 
     . If devices no longer hear NTP messages from servers, configure the internal routers as master
        > NTP server         = NTP primary server
        > NTP client/server  = NTP secondary server
     . Internet NTP servers has stratum =1 , Ex: US national institute of standard and technology (NIST) 

              (config)# ntp server time-a-b-nist.gov
              (config)# ntp server time-a-g.nist.gov
              (config)# ntp master 7

---------------------------------------------------------------------------------

   - NTP using Loopback Interface for better Availability: 
     ----------------------------------------------------
     ----------------------------------------------------
     . Cisco uses the router loopback interface 
     . loopback interfaces are virtual interfaces internal to cisco IOS & not tied to any physical interface
     . Loopback Interface:
        -> can be assigned an ip-address 
        -> routing protocols can advertise about the subnet 
        -> you can ping/trace route to the address 
        -> once configured, it remain in up/up state as long:
            >> router remains up 
            >> you don't issue a shut down command

       -----------------------------------------

              R4(config)# interface loopback 0
              R4(config-if)# ip address 172.16.9.9  255.255.255.255
                                                                                     
              R4(config)# ntp master 4
              R4(config)# ntp source loopback 0
             --------------------
              R4# show interfaces loopback 0

             --------------------
              R1(config)# ntp server 172.16.9.9

===========================================================================================================
===========================================================================================================
===========================================================================================================

>> CDP (Cisco Discovery Protocol): Device Management protocols (Syslog, NTP, CDP, LLDP)
   ==============================
   - Layer2 protocol, use multicast address 0100.0CCC.CCCC
   - cisco proprietary protocol
   - Rs & SWs send CDP msgs out of there interfaces to announce info about the device 
   - CDP learn about direct neighbors only

   - CDP msg details:
     ---------------
      1. Device identifier   >>>>> "host name"
      2. Address list        >>>>> "IP-add & MAC-add"
      3. Port identifier     >>>>> "the interface on the remote device"
      4. Capabilities list   >>>>> "device type R or SW"
      5. Platform            >>>>> "modle & IOS running"
     ---------------
     Show:
       # show cdp neighbors
       # show cdp neighbors [interface number]
       # show cdp neighbors detail                   >>>>> show the nieghbor IP-add
       # show cdp entry "device-name"                >>>>> detail for spacific device 

   - cisco recommend to disable CDP to avoid any security exposure
   - cisco IOS enables CDP globally and on each interface by default 
     ---------------
       (config-if)# no cdp enable                    >>>>> disable CDP on an interface
       (config-if)# cdp enable                       >>>>> enable CDP on an interface 
       (config)# no cdp run                          >>>>> disable CDP globally
       (config)# cdp run                             >>>>> enable CDP globally
     --------------- 
         # show cdp                                  >>>>> global cdp status and timers
         # show cdp interface [interface-number]     >>>>> interface cdp status and timers
         # show cdp traffic
     ---------------
   - CDP sends msg every 60sec by default with a hold time of 180sec
       (config)# cdp timer "sec"
       (config)# cdp holdtime "sec"

----------------------------------------------------------


>> LLDP (Link Layer Discovery Protocol): Device Management protocols (Syslog, NTP, CDP, LLDP)
   ====================================
   - Layer2 protocol, use multicast address 0180.C200.000E
   - Defined in IEEE standard 802.1AB
   - provides a standardized protocol that provides the same general feature as CDP 
   - LLDP has simillar configuration and identical show commands as CDP
   - cisco default to disable LLDP
     ---------------
     Show:
       # show lldp neighbors
       # show lldp neighbors [interface number]
       # show lldp neighbors detail                                            >>>>> show the nieghbor IP-add
       # show lldp entry "device-name"                                         >>>>> detail for spacific device 
     ---------------
       (config)# [no] lldp run                                                 >>>>> enable & disable lldp in both direction
      ---------------
    - operation of lldp on the interface regardless of the global run command
       (config-if)# [no] lldp transmit                                         >>>>> transmit lldp or not per interface
       (config-if)# [no] lldp receive                                          >>>>> process received lldp or not per interface
     --------------- 
         # show lldp                                                           >>>>> global lldp status and timers
         # show lldp interface [interface-number]                              >>>>> interface lldp status and timers
         # show lldp traffic
     ---------------
   - CDP sends msg every 30sec by default with a hold time of 120sec
       (config-if)# lldp timer "sec"
       (config-if)# lldp holdtime "sec"


===========================================================================================================
===========================================================================================================
===========================================================================================================

>> QoS (Quality of Service):
   ========================
   - QoS give certain kinds of network traffic priority over others (((during congestion))) to minimize "Delay and packet loss"
   - prioritize the packets based on priority which is set by the queue scheduling algorithm prioritization 

   - QoS tools manage four characteristics:
     1. Bandwidth   >>>>> how many bits can be sent over the link per second 
     2. Delay       >>>>> measur in two way (1. one-way delay 2. Round-trip delay)
                    >>>>> delay impacted by (queuing & shaping delay)
     3. Jitter      >>>>> The variation in one-way delay between consecutive packets sent by the same application  
     4. Loss        >>>>> the percentage of packets sent that do not reach their destination
                          (faulty cable, poor wan services, congested network)

   - QoS should have some overall good effect to influence the user QoE (Quality of Experience)
   - data and voice/video applications are classified into (interactive & noninteractive)

   - Classification "Matching" and Marking:
     -------------------------------------
     . congestion happend > forowarding dicision > classification "Matching" > queuing based on marking on packet header > scheduler algorithm prioritizing packets 
     . QoS much like the positioning of ACL
        . Location  >>>>> enabled on an interface 
        . Direction >>>>> in/out
        . Action    >>>>> queuing, policing, shaping 

-------------------------------------------------------------
   - QoS planing:
     -----------
     -----------
     1. Classification:
        --------------
        >> using an ACL
        >> using NBAR (Network Based Application Recognition)              >>>>> deep packet inspection up to Layer-7 (cisco propriatory)
                                                                                   (second version NBAR2 use application signatures)
            -----------
            (config)# class-map matchingexample
            (config-cmap)# match protocol attribute category voice-and-video ?
            -----------
            
     2. Marking:
        -------
        >> DSCP (Differentiated Service Code Point)(DiffServ)(6-bit) / IPP (IP Precendence)(3-bit) >>>>> field in the IP header used to identify high/low priority traffic
                                                                                                          . IP exist for the entire trip (End-toend packet)
                                                                                                          . IPv4 define 1-byte field ToS (type of service) to be used by marking 
                                                                                                          . IPv6 define 1-byte (traffic class byte) 
                                                                                                          . DSCP = 6-bit = 64 marking value = 64 class available 

        >> PCP (Priority Code Point) /or\ CoS (class of service)                                   >>>>> field in the 802.1q tag (ethernet header) used to identify high/low priority traffic
                                                                                                          . defined by IEEE 802.1P
                                                                                                          . 3-bit set in the third byte of 4-byte 802.1Q (8 marking values) 
                                                                                                          . used internally in the lan over trunk ports only 
        >> TID >> use 802.11 heder      >> used for marking over wi-fi 
        >> EXP >> use MPLS Label header >> used for marking over MPLS WAN

-------------------------------------------------------------

   - Trust Boundaries:
     ----------------
     . point in the path where the network devices can trust the current QoS marking "could be in the firest ingress switch in the network"
     . IP-Phone is a trust boundary as the marking value are actually configured on the attached switch 

-------------------------------------------------------------

   - DiffServ Suggested Marking Values:
     ---------------------------------
     ---------------------------------
     . Standered marking simplified QoS design & implementation and work better between an interprise & ISP
     . IPP and DSCP can be rfered by there decimal values as well as some convenient text names
        1) Expedited Forwarding (EF)
           ------------------------
           . used for packets that need low latancy (delay), jitter, loss
           . DSCP decimal value= 46 <=> equivalent text name EF
           . Most often QoS plans use EF to mark voice payload packets
        2) Assured Forwarding (AF)
           ----------------------
           . A set of 12 DSCP marking values
           . Define 4 separate classes and define 3 levels of drop priority (AFXY)
              X > refer to the queue (1-4)         >>>>> higher is best queue
              Y > refer to the drop priority (1-3) >>>>> higher is worst "most likely to drop during congestion"
           . Ex:
              AF11 = 8X + 2Y = DSCP 10
              AF22 = 8X + 2Y = DSCP 20
        3) Class Selector (CS)
           -------------------
           . CS has 8 values (name & decimal values) for IPP compatibility (CS0 - CS7)

-------------------------------------------------------------

   - Cisco Standardized QoS:
     ----------------------
     ----------------------
     . EF     >>>>> voice payload
     . AF4X   >>>>> interactive video (video conferencing)
     . AF3X   >>>>> Streaming video
     . AF2X   >>>>> High priority data (low latency)
     . CS0    >>>>> Standared data 

===========================================================================================================
===========================================================================================================
===========================================================================================================


>> FHRP (First Hop Redundancy Protocol):
   ====================================
   ====================================
   - FHRP provide redundant default routers (avoid single point of falier)
   - FHRP refers to a category of protocols that can be used
   - FHRP is a protocol protect the DG in the event of failure (If R1 down R2 automatically become the DG, user DG & ARP table remain the same)
   - Rs use configured Virtual-IP & generated Virtual-MAC & BC Gratuitous ARP reply to switch to the backup new path 
   - FHRP are on-preemptive 


---------------------------------------------------------

  1) HSRP (Hot Standby Router Protocol):
     ==================================
      - Default (Active/standby) but HSRP can suport load balancing "LB per subnet/VLAN" require ROAS, or "LB per group"
      - cisco proprietary

     R(config)# interface g0/0                 >>>>> local subnet interface 
     R(config)# standby version 2              >>>>> HSRP v1 & v2 are not compatible 
     R(config-if)# standby 1 ip 172.16.0.254   >>>>> enable group # and HSRP ipv4 || & ste the virtual-IP address
     R(config-if)# standby 1 priority 200      >>>>> default priority 100 
                                               >>>>> Active router is (1) Highest priority (2) Highest IP address     
     R(config-if)# standby 1 preempt           >>>>> if active router down and went up again to be elected back as the active  

   ------------------
    Show:
     R# show standby                         >>>>> hsrp status, interface, group#, version, V-IP, V-MAC, timers, preemption status, Active/standby IPs, priority set
     R# show standby brief  
     R# show run interface vlan 100

---------------------------------------------------------

  2) VRRP (Virtual Router Redundancy Protocol):
     =========================================
      - open Standered
      - Default (Master/Backup), support LB per VLAN/subnet

     R(config)# vrrp 10 ip 10.0.10.1
     R(config)# vrrp 10 priority 200

---------------------------------------------------------

  3) GLBP (Gateway Load Balancing Protocol)
     ======================================
      - cisco proprietary
      - Default (Active/active) load balances among multiple routers within a single subnet (per host)
      - AVG (Active Virtual Gateway) / AVFs (Active Virtual Forwarders) ,AVF assigned by the AVG, AVG can be AVF too
      - each AVF can act as DG for portion of hosts in the subnet 


===========================================================================================================
===========================================================================================================
===========================================================================================================

>> SNMP (Simple Network Management Protocol):
   =========================================
   =========================================

   - What is the difference between bandwidth and throughput? 
     . Network bandwidth determines the network's capacity of how much data in network can possibly travel in a period of time, 
       while network throughput measures how much data actually travels in a period of time.




===========================================================================================================
===========================================================================================================
===========================================================================================================

>> File Transfer Protocol / Trivial File Transfer Protocol (FTP/TFTP): (SCP "secure copy protocol", Encrypted) (FTPS "FTP over SSL/TLS", encrypted)
   ================================================================== 
   ================================================================== 
      - TFTP not encrypted
      - FTP not encrypted but use authentication 
      - SCP "secure copy protocol", Encrypted
      - FTPS "FTP over SSL/TLS", encrypted
        . secure socket layer / transport layer security 
      - SFTP "security SSH FTP", encrypted


   - Every OS creates file system to organiz and store files
   - for each physical memory device in the router IOS creates a simple IOS file system an give that device a name 
      Ex: disk - usbflash
      ---------------
       R# show file systems         >>>>> size "byte", free space, type 
       R# more flash0:/wotemp/fred  >>>>> directly refer to a file using formal name 
       R# show run                  
       R# show start
       R# show flash                >>>>> refer to default flash IFS"Integrated file system" (usually flash0:)
      ---------------

   - File system types:
     -----------------
     -----------------
      . Opaque    >>>>> logical internal file systems "internal functions and commands"
      . Network   >>>>> External file systems "servers reference in diff commands"
      . Disk      >>>>> Flash
      . Usbflash  >>>>> USB Flash
      . NVRAM     >>>>> default location for startup-config file 

    
   - Upgrading IOS Images:  upload the image to FTP/TFTP server or use USB Flash 
     --------------------
     --------------------
     1) download the ios image from cisco website 
     2) upload the image to FTP/TFTP server 
     3) copy from soures to distenation 
       R# copy tftp flash  
      or   
       R(config)# ip ftp username mohab
       R(config)# ip ftp password 123
       R# copy ftp flash                        >>>>> using senchronized name/pass (FTP/R)
         . server ip/name
         . ios file name  
     4) choose the booting file                              >>>>> (by default will boot from the first file in the flash)
       R(config)# boot system flash: c2900....
     5) save your work
       R# write memory
     6) reload the device 
       R# reload 
      ---------------
    Show:
       R# show version
       R# delete flash: c2800...
       R# show flash                                         >>>>> refer to default flash IFS"Integrated file system" (usually flash0:)
       R# dir flash0:                                        >>>>> refer to default flash IFS"Integrated file system" (usually flash0:) , show the free space 

------------------------------------------------------

   - Verifying IOS code Integrity with MD5
     -------------------------------------
      . use the MD5 hash value published by cisco and compare it to the hex code output on your router 
      ---------------
       R# verify /md5 flash0: c2900....
      ---------------

------------------------------------------------------

   - Upgrading IOS Images using URI:
     ------------------------------
     ------------------------------
     1) download the ios image from cisco website 
     2) upload the image to FTP server 
     3) download from soures URI using senchronized name/pass (FTP/R)
       R# copy ftp://mohab:123@192.168.1.170/c2900.....
      or
       R(config)# ip ftp username mohab
       R(config)# ip ftp password 123
       R# copy ftp://192.168.1.170/c2900.....

       R# show flash                          >>>>> refer to default flash IFS"Integrated file system" (usually flash0:)
       R# dir flash0:                         >>>>> refer to default flash IFS"Integrated file system" (usually flash0:) , show the free space 
     4) choose the booting file               >>>>> (by default will boot from the first file in the flash)
       R(config)# boot system flash: c2900....
     5) save your work
       R# write memory
     6) reload the device 
       R# reload 
      ---------------
       R# show version
       R# delete flash: c2800...
       R# show flash 





























